/* automatically generated by rust-bindgen 0.65.1 */

pub const LEXBOR_FORMAT_Z: &[u8; 4usize] = b"%Iu\0";
pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const WCHAR_MIN: u32 = 0;
pub const WCHAR_MAX: u32 = 65535;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 65535;
pub const __bool_true_false_are_defined: u32 = 1;
pub const false_: u32 = 0;
pub const true_: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;

pub type uint_least32_t = cty::c_uint;
pub type uint_least64_t = cty::c_ulonglong;
pub type int_fast8_t = cty::c_schar;
pub type int_fast16_t = cty::c_int;
pub type int_fast32_t = cty::c_int;
pub type int_fast64_t = cty::c_longlong;
pub type uint_fast8_t = cty::c_uchar;
pub type uint_fast16_t = cty::c_uint;
pub type uint_fast32_t = cty::c_uint;
pub type uint_fast64_t = cty::c_ulonglong;
pub type intmax_t = cty::c_longlong;
pub type uintmax_t = cty::c_ulonglong;
pub type lxb_codepoint_t = u32;
pub type lxb_char_t = cty::c_uchar;
pub type lxb_status_t = cty::c_uint;
pub type lexbor_callback_f = ::core::option::Option<
    unsafe extern "C" fn(
        buffer: *const lxb_char_t,
        size: usize,
        ctx: *mut cty::c_void,
    ) -> lxb_status_t,
>;
pub type lexbor_memory_malloc_f =
    ::core::option::Option<unsafe extern "C" fn(size: usize) -> *mut cty::c_void>;
pub type lexbor_memory_realloc_f = ::core::option::Option<
    unsafe extern "C" fn(dst: *mut cty::c_void, size: usize) -> *mut cty::c_void,
>;
pub type lexbor_memory_calloc_f =
    ::core::option::Option<unsafe extern "C" fn(num: usize, size: usize) -> *mut cty::c_void>;
pub type lexbor_memory_free_f = ::core::option::Option<unsafe extern "C" fn(dst: *mut cty::c_void)>;
extern "C" {
    pub fn lexbor_malloc(size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_realloc(dst: *mut cty::c_void, size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_calloc(num: usize, size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_free(dst: *mut cty::c_void) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_memory_setup(
        new_malloc: lexbor_memory_malloc_f,
        new_realloc: lexbor_memory_realloc_f,
        new_calloc: lexbor_memory_calloc_f,
        new_free: lexbor_memory_free_f,
    ) -> lxb_status_t;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: cty::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = cty::c_int;
pub type wint_t = cty::c_ushort;
pub type wctype_t = cty::c_ushort;
pub type __time32_t = cty::c_long;
pub type __time64_t = cty::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const cty::c_ushort,
    pub _locale_mb_cur_max: cty::c_int,
    pub _locale_lc_codepage: cty::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    const UNINIT: ::core::mem::MaybeUninit<__crt_locale_data_public> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::core::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_pctype)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_mb_cur_max)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_lc_codepage)
        )
    );
}
impl Default for __crt_locale_data_public {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    const UNINIT: ::core::mem::MaybeUninit<__crt_locale_pointers> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::core::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(mbcinfo)
        )
    );
}
impl Default for __crt_locale_pointers {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _Mbstatet {
    pub _Wchar: cty::c_ulong,
    pub _Byte: cty::c_ushort,
    pub _State: cty::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    const UNINIT: ::core::mem::MaybeUninit<_Mbstatet> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::core::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Wchar)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Byte)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._State) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_State)
        )
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
extern "C" {
    pub fn _calloc_base(_Count: usize, _Size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn calloc(_Count: cty::c_ulonglong, _Size: cty::c_ulonglong) -> *mut cty::c_void;
}
extern "C" {
    pub fn _callnewh(_Size: usize) -> cty::c_int;
}
extern "C" {
    pub fn _expand(_Block: *mut cty::c_void, _Size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn _free_base(_Block: *mut cty::c_void);
}
extern "C" {
    pub fn free(_Block: *mut cty::c_void);
}
extern "C" {
    pub fn _malloc_base(_Size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn malloc(_Size: cty::c_ulonglong) -> *mut cty::c_void;
}
extern "C" {
    pub fn _msize_base(_Block: *mut cty::c_void) -> usize;
}
extern "C" {
    pub fn _msize(_Block: *mut cty::c_void) -> usize;
}
extern "C" {
    pub fn _realloc_base(_Block: *mut cty::c_void, _Size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn realloc(_Block: *mut cty::c_void, _Size: cty::c_ulonglong) -> *mut cty::c_void;
}
extern "C" {
    pub fn _recalloc_base(
        _Block: *mut cty::c_void,
        _Count: usize,
        _Size: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn _recalloc(_Block: *mut cty::c_void, _Count: usize, _Size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn _aligned_free(_Block: *mut cty::c_void);
}
extern "C" {
    pub fn _aligned_malloc(_Size: usize, _Alignment: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn _aligned_offset_malloc(
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn _aligned_msize(_Block: *mut cty::c_void, _Alignment: usize, _Offset: usize) -> usize;
}
extern "C" {
    pub fn _aligned_offset_realloc(
        _Block: *mut cty::c_void,
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn _aligned_offset_recalloc(
        _Block: *mut cty::c_void,
        _Count: usize,
        _Size: usize,
        _Alignment: usize,
        _Offset: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn _aligned_realloc(
        _Block: *mut cty::c_void,
        _Size: usize,
        _Alignment: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn _aligned_recalloc(
        _Block: *mut cty::c_void,
        _Count: usize,
        _Size: usize,
        _Alignment: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn _errno() -> *mut cty::c_int;
}
extern "C" {
    pub fn _set_errno(_Value: cty::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_errno(_Value: *mut cty::c_int) -> errno_t;
}
extern "C" {
    pub fn __threadid() -> cty::c_ulong;
}
extern "C" {
    pub fn __threadhandle() -> usize;
}
pub type _CoreCrtSecureSearchSortCompareFunction = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *mut cty::c_void,
        arg2: *const cty::c_void,
        arg3: *const cty::c_void,
    ) -> cty::c_int,
>;
pub type _CoreCrtNonSecureSearchSortCompareFunction = ::core::option::Option<
    unsafe extern "C" fn(arg1: *const cty::c_void, arg2: *const cty::c_void) -> cty::c_int,
>;
extern "C" {
    pub fn bsearch_s(
        _Key: *const cty::c_void,
        _Base: *const cty::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut cty::c_void,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn qsort_s(
        _Base: *mut cty::c_void,
        _NumOfElements: rsize_t,
        _SizeOfElements: rsize_t,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut cty::c_void,
    );
}
extern "C" {
    pub fn bsearch(
        _Key: *const cty::c_void,
        _Base: *const cty::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn qsort(
        _Base: *mut cty::c_void,
        _NumOfElements: usize,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    );
}
extern "C" {
    pub fn _lfind_s(
        _Key: *const cty::c_void,
        _Base: *const cty::c_void,
        _NumOfElements: *mut cty::c_uint,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut cty::c_void,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn _lfind(
        _Key: *const cty::c_void,
        _Base: *const cty::c_void,
        _NumOfElements: *mut cty::c_uint,
        _SizeOfElements: cty::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn _lsearch_s(
        _Key: *const cty::c_void,
        _Base: *mut cty::c_void,
        _NumOfElements: *mut cty::c_uint,
        _SizeOfElements: usize,
        _CompareFunction: _CoreCrtSecureSearchSortCompareFunction,
        _Context: *mut cty::c_void,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn _lsearch(
        _Key: *const cty::c_void,
        _Base: *mut cty::c_void,
        _NumOfElements: *mut cty::c_uint,
        _SizeOfElements: cty::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lfind(
        _Key: *const cty::c_void,
        _Base: *const cty::c_void,
        _NumOfElements: *mut cty::c_uint,
        _SizeOfElements: cty::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lsearch(
        _Key: *const cty::c_void,
        _Base: *mut cty::c_void,
        _NumOfElements: *mut cty::c_uint,
        _SizeOfElements: cty::c_uint,
        _CompareFunction: _CoreCrtNonSecureSearchSortCompareFunction,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn _itow_s(
        _Value: cty::c_int,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _itow(_Value: cty::c_int, _Buffer: *mut wchar_t, _Radix: cty::c_int) -> *mut wchar_t;
}
extern "C" {
    pub fn _ltow_s(
        _Value: cty::c_long,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ltow(_Value: cty::c_long, _Buffer: *mut wchar_t, _Radix: cty::c_int) -> *mut wchar_t;
}
extern "C" {
    pub fn _ultow_s(
        _Value: cty::c_ulong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ultow(_Value: cty::c_ulong, _Buffer: *mut wchar_t, _Radix: cty::c_int) -> *mut wchar_t;
}
extern "C" {
    pub fn wcstod(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn _wcstod_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn wcstol(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
    ) -> cty::c_long;
}
extern "C" {
    pub fn _wcstol_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_long;
}
extern "C" {
    pub fn wcstoll(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
    ) -> cty::c_longlong;
}
extern "C" {
    pub fn _wcstoll_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_longlong;
}
extern "C" {
    pub fn wcstoul(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
    ) -> cty::c_ulong;
}
extern "C" {
    pub fn _wcstoul_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_ulong;
}
extern "C" {
    pub fn wcstoull(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn _wcstoull_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn wcstold(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f64;
}
extern "C" {
    pub fn _wcstold_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn wcstof(_String: *const wchar_t, _EndPtr: *mut *mut wchar_t) -> f32;
}
extern "C" {
    pub fn _wcstof_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Locale: _locale_t,
    ) -> f32;
}
extern "C" {
    pub fn _wtof(_String: *const wchar_t) -> f64;
}
extern "C" {
    pub fn _wtof_l(_String: *const wchar_t, _Locale: _locale_t) -> f64;
}
extern "C" {
    pub fn _wtoi(_String: *const wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn _wtoi_l(_String: *const wchar_t, _Locale: _locale_t) -> cty::c_int;
}
extern "C" {
    pub fn _wtol(_String: *const wchar_t) -> cty::c_long;
}
extern "C" {
    pub fn _wtol_l(_String: *const wchar_t, _Locale: _locale_t) -> cty::c_long;
}
extern "C" {
    pub fn _wtoll(_String: *const wchar_t) -> cty::c_longlong;
}
extern "C" {
    pub fn _wtoll_l(_String: *const wchar_t, _Locale: _locale_t) -> cty::c_longlong;
}
extern "C" {
    pub fn _i64tow_s(
        _Value: cty::c_longlong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _i64tow(
        _Value: cty::c_longlong,
        _Buffer: *mut wchar_t,
        _Radix: cty::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _ui64tow_s(
        _Value: cty::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Radix: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ui64tow(
        _Value: cty::c_ulonglong,
        _Buffer: *mut wchar_t,
        _Radix: cty::c_int,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wtoi64(_String: *const wchar_t) -> cty::c_longlong;
}
extern "C" {
    pub fn _wtoi64_l(_String: *const wchar_t, _Locale: _locale_t) -> cty::c_longlong;
}
extern "C" {
    pub fn _wcstoi64(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
    ) -> cty::c_longlong;
}
extern "C" {
    pub fn _wcstoi64_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_longlong;
}
extern "C" {
    pub fn _wcstoui64(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn _wcstoui64_l(
        _String: *const wchar_t,
        _EndPtr: *mut *mut wchar_t,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn _wfullpath(
        _Buffer: *mut wchar_t,
        _Path: *const wchar_t,
        _BufferCount: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wmakepath_s(
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Drive: *const wchar_t,
        _Dir: *const wchar_t,
        _Filename: *const wchar_t,
        _Ext: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wmakepath(
        _Buffer: *mut wchar_t,
        _Drive: *const wchar_t,
        _Dir: *const wchar_t,
        _Filename: *const wchar_t,
        _Ext: *const wchar_t,
    );
}
extern "C" {
    pub fn _wperror(_ErrorMessage: *const wchar_t);
}
extern "C" {
    pub fn _wsplitpath(
        _FullPath: *const wchar_t,
        _Drive: *mut wchar_t,
        _Dir: *mut wchar_t,
        _Filename: *mut wchar_t,
        _Ext: *mut wchar_t,
    );
}
extern "C" {
    pub fn _wsplitpath_s(
        _FullPath: *const wchar_t,
        _Drive: *mut wchar_t,
        _DriveCount: usize,
        _Dir: *mut wchar_t,
        _DirCount: usize,
        _Filename: *mut wchar_t,
        _FilenameCount: usize,
        _Ext: *mut wchar_t,
        _ExtCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wdupenv_s(
        _Buffer: *mut *mut wchar_t,
        _BufferCount: *mut usize,
        _VarName: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wgetenv(_VarName: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wgetenv_s(
        _RequiredCount: *mut usize,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _VarName: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wputenv(_EnvString: *const wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn _wputenv_s(_Name: *const wchar_t, _Value: *const wchar_t) -> errno_t;
}
extern "C" {
    pub fn _wsearchenv_s(
        _Filename: *const wchar_t,
        _VarName: *const wchar_t,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wsearchenv(
        _Filename: *const wchar_t,
        _VarName: *const wchar_t,
        _ResultPath: *mut wchar_t,
    );
}
extern "C" {
    pub fn _wsystem(_Command: *const wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn _swab(_Buf1: *mut cty::c_char, _Buf2: *mut cty::c_char, _SizeInBytes: cty::c_int);
}
extern "C" {
    pub fn exit(_Code: cty::c_int) -> !;
}
extern "C" {
    pub fn _exit(_Code: cty::c_int) -> !;
}
extern "C" {
    pub fn _Exit(_Code: cty::c_int) -> !;
}
extern "C" {
    pub fn quick_exit(_Code: cty::c_int) -> !;
}
extern "C" {
    pub fn abort() -> !;
}
extern "C" {
    pub fn _set_abort_behavior(_Flags: cty::c_uint, _Mask: cty::c_uint) -> cty::c_uint;
}
pub type _onexit_t = ::core::option::Option<unsafe extern "C" fn() -> cty::c_int>;
extern "C" {
    pub fn atexit(arg1: ::core::option::Option<unsafe extern "C" fn()>) -> cty::c_int;
}
extern "C" {
    pub fn _onexit(_Func: _onexit_t) -> _onexit_t;
}
extern "C" {
    pub fn at_quick_exit(arg1: ::core::option::Option<unsafe extern "C" fn()>) -> cty::c_int;
}
pub type _purecall_handler = ::core::option::Option<unsafe extern "C" fn()>;
pub type _invalid_parameter_handler = ::core::option::Option<
    unsafe extern "C" fn(
        arg1: *const wchar_t,
        arg2: *const wchar_t,
        arg3: *const wchar_t,
        arg4: cty::c_uint,
        arg5: usize,
    ),
>;
extern "C" {
    pub fn _set_purecall_handler(_Handler: _purecall_handler) -> _purecall_handler;
}
extern "C" {
    pub fn _get_purecall_handler() -> _purecall_handler;
}
extern "C" {
    pub fn _set_invalid_parameter_handler(
        _Handler: _invalid_parameter_handler,
    ) -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _get_invalid_parameter_handler() -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _set_thread_local_invalid_parameter_handler(
        _Handler: _invalid_parameter_handler,
    ) -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _get_thread_local_invalid_parameter_handler() -> _invalid_parameter_handler;
}
extern "C" {
    pub fn _set_error_mode(_Mode: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn __doserrno() -> *mut cty::c_ulong;
}
extern "C" {
    pub fn _set_doserrno(_Value: cty::c_ulong) -> errno_t;
}
extern "C" {
    pub fn _get_doserrno(_Value: *mut cty::c_ulong) -> errno_t;
}
extern "C" {
    pub fn __sys_errlist() -> *mut *mut cty::c_char;
}
extern "C" {
    pub fn __sys_nerr() -> *mut cty::c_int;
}
extern "C" {
    pub fn perror(_ErrMsg: *const cty::c_char);
}
extern "C" {
    pub fn __p__pgmptr() -> *mut *mut cty::c_char;
}
extern "C" {
    pub fn __p__wpgmptr() -> *mut *mut wchar_t;
}
extern "C" {
    pub fn __p__fmode() -> *mut cty::c_int;
}
extern "C" {
    pub fn _get_pgmptr(_Value: *mut *mut cty::c_char) -> errno_t;
}
extern "C" {
    pub fn _get_wpgmptr(_Value: *mut *mut wchar_t) -> errno_t;
}
extern "C" {
    pub fn _set_fmode(_Mode: cty::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_fmode(_PMode: *mut cty::c_int) -> errno_t;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _div_t {
    pub quot: cty::c_int,
    pub rem: cty::c_int,
}
#[test]
fn bindgen_test_layout__div_t() {
    const UNINIT: ::core::mem::MaybeUninit<_div_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_div_t>(),
        8usize,
        concat!("Size of: ", stringify!(_div_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_div_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_div_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_div_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_div_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type div_t = _div_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _ldiv_t {
    pub quot: cty::c_long,
    pub rem: cty::c_long,
}
#[test]
fn bindgen_test_layout__ldiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<_ldiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_ldiv_t>(),
        8usize,
        concat!("Size of: ", stringify!(_ldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_ldiv_t>(),
        4usize,
        concat!("Alignment of ", stringify!(_ldiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_ldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_ldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type ldiv_t = _ldiv_t;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _lldiv_t {
    pub quot: cty::c_longlong,
    pub rem: cty::c_longlong,
}
#[test]
fn bindgen_test_layout__lldiv_t() {
    const UNINIT: ::core::mem::MaybeUninit<_lldiv_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_lldiv_t>(),
        16usize,
        concat!("Size of: ", stringify!(_lldiv_t))
    );
    assert_eq!(
        ::core::mem::align_of::<_lldiv_t>(),
        8usize,
        concat!("Alignment of ", stringify!(_lldiv_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).quot) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_lldiv_t),
            "::",
            stringify!(quot)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).rem) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_lldiv_t),
            "::",
            stringify!(rem)
        )
    );
}
pub type lldiv_t = _lldiv_t;
extern "C" {
    pub fn abs(_Number: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn labs(_Number: cty::c_long) -> cty::c_long;
}
extern "C" {
    pub fn llabs(_Number: cty::c_longlong) -> cty::c_longlong;
}
extern "C" {
    pub fn _abs64(_Number: cty::c_longlong) -> cty::c_longlong;
}
extern "C" {
    pub fn _byteswap_ushort(_Number: cty::c_ushort) -> cty::c_ushort;
}
extern "C" {
    pub fn _byteswap_ulong(_Number: cty::c_ulong) -> cty::c_ulong;
}
extern "C" {
    pub fn _byteswap_uint64(_Number: cty::c_ulonglong) -> cty::c_ulonglong;
}
extern "C" {
    pub fn div(_Numerator: cty::c_int, _Denominator: cty::c_int) -> div_t;
}
extern "C" {
    pub fn ldiv(_Numerator: cty::c_long, _Denominator: cty::c_long) -> ldiv_t;
}
extern "C" {
    pub fn lldiv(_Numerator: cty::c_longlong, _Denominator: cty::c_longlong) -> lldiv_t;
}
extern "C" {
    pub fn _rotl(_Value: cty::c_uint, _Shift: cty::c_int) -> cty::c_uint;
}
extern "C" {
    pub fn _lrotl(_Value: cty::c_ulong, _Shift: cty::c_int) -> cty::c_ulong;
}
extern "C" {
    pub fn _rotl64(_Value: cty::c_ulonglong, _Shift: cty::c_int) -> cty::c_ulonglong;
}
extern "C" {
    pub fn _rotr(_Value: cty::c_uint, _Shift: cty::c_int) -> cty::c_uint;
}
extern "C" {
    pub fn _lrotr(_Value: cty::c_ulong, _Shift: cty::c_int) -> cty::c_ulong;
}
extern "C" {
    pub fn _rotr64(_Value: cty::c_ulonglong, _Shift: cty::c_int) -> cty::c_ulonglong;
}
extern "C" {
    pub fn srand(_Seed: cty::c_uint);
}
extern "C" {
    pub fn rand() -> cty::c_int;
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _LDOUBLE {
    pub ld: [cty::c_uchar; 10usize],
}
#[test]
fn bindgen_test_layout__LDOUBLE() {
    const UNINIT: ::core::mem::MaybeUninit<_LDOUBLE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_LDOUBLE>(),
        10usize,
        concat!("Size of: ", stringify!(_LDOUBLE))
    );
    assert_eq!(
        ::core::mem::align_of::<_LDOUBLE>(),
        1usize,
        concat!("Alignment of ", stringify!(_LDOUBLE))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ld) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LDOUBLE),
            "::",
            stringify!(ld)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _CRT_DOUBLE {
    pub x: f64,
}
#[test]
fn bindgen_test_layout__CRT_DOUBLE() {
    const UNINIT: ::core::mem::MaybeUninit<_CRT_DOUBLE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_CRT_DOUBLE>(),
        8usize,
        concat!("Size of: ", stringify!(_CRT_DOUBLE))
    );
    assert_eq!(
        ::core::mem::align_of::<_CRT_DOUBLE>(),
        8usize,
        concat!("Alignment of ", stringify!(_CRT_DOUBLE))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CRT_DOUBLE),
            "::",
            stringify!(x)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _CRT_FLOAT {
    pub f: f32,
}
#[test]
fn bindgen_test_layout__CRT_FLOAT() {
    const UNINIT: ::core::mem::MaybeUninit<_CRT_FLOAT> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_CRT_FLOAT>(),
        4usize,
        concat!("Size of: ", stringify!(_CRT_FLOAT))
    );
    assert_eq!(
        ::core::mem::align_of::<_CRT_FLOAT>(),
        4usize,
        concat!("Alignment of ", stringify!(_CRT_FLOAT))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).f) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_CRT_FLOAT),
            "::",
            stringify!(f)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _LONGDOUBLE {
    pub x: f64,
}
#[test]
fn bindgen_test_layout__LONGDOUBLE() {
    const UNINIT: ::core::mem::MaybeUninit<_LONGDOUBLE> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_LONGDOUBLE>(),
        8usize,
        concat!("Size of: ", stringify!(_LONGDOUBLE))
    );
    assert_eq!(
        ::core::mem::align_of::<_LONGDOUBLE>(),
        8usize,
        concat!("Alignment of ", stringify!(_LONGDOUBLE))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).x) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LONGDOUBLE),
            "::",
            stringify!(x)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct _LDBL12 {
    pub ld12: [cty::c_uchar; 12usize],
}
#[test]
fn bindgen_test_layout__LDBL12() {
    const UNINIT: ::core::mem::MaybeUninit<_LDBL12> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_LDBL12>(),
        12usize,
        concat!("Size of: ", stringify!(_LDBL12))
    );
    assert_eq!(
        ::core::mem::align_of::<_LDBL12>(),
        1usize,
        concat!("Alignment of ", stringify!(_LDBL12))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ld12) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_LDBL12),
            "::",
            stringify!(ld12)
        )
    );
}
extern "C" {
    pub fn atof(_String: *const cty::c_char) -> f64;
}
extern "C" {
    pub fn atoi(_String: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn atol(_String: *const cty::c_char) -> cty::c_long;
}
extern "C" {
    pub fn atoll(_String: *const cty::c_char) -> cty::c_longlong;
}
extern "C" {
    pub fn _atoi64(_String: *const cty::c_char) -> cty::c_longlong;
}
extern "C" {
    pub fn _atof_l(_String: *const cty::c_char, _Locale: _locale_t) -> f64;
}
extern "C" {
    pub fn _atoi_l(_String: *const cty::c_char, _Locale: _locale_t) -> cty::c_int;
}
extern "C" {
    pub fn _atol_l(_String: *const cty::c_char, _Locale: _locale_t) -> cty::c_long;
}
extern "C" {
    pub fn _atoll_l(_String: *const cty::c_char, _Locale: _locale_t) -> cty::c_longlong;
}
extern "C" {
    pub fn _atoi64_l(_String: *const cty::c_char, _Locale: _locale_t) -> cty::c_longlong;
}
extern "C" {
    pub fn _atoflt(_Result: *mut _CRT_FLOAT, _String: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn _atodbl(_Result: *mut _CRT_DOUBLE, _String: *mut cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn _atoldbl(_Result: *mut _LDOUBLE, _String: *mut cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn _atoflt_l(
        _Result: *mut _CRT_FLOAT,
        _String: *const cty::c_char,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _atodbl_l(
        _Result: *mut _CRT_DOUBLE,
        _String: *mut cty::c_char,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _atoldbl_l(
        _Result: *mut _LDOUBLE,
        _String: *mut cty::c_char,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn strtof(_String: *const cty::c_char, _EndPtr: *mut *mut cty::c_char) -> f32;
}
extern "C" {
    pub fn _strtof_l(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Locale: _locale_t,
    ) -> f32;
}
extern "C" {
    pub fn strtod(_String: *const cty::c_char, _EndPtr: *mut *mut cty::c_char) -> f64;
}
extern "C" {
    pub fn _strtod_l(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtold(_String: *const cty::c_char, _EndPtr: *mut *mut cty::c_char) -> f64;
}
extern "C" {
    pub fn _strtold_l(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Locale: _locale_t,
    ) -> f64;
}
extern "C" {
    pub fn strtol(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> cty::c_long;
}
extern "C" {
    pub fn _strtol_l(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_long;
}
extern "C" {
    pub fn strtoll(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> cty::c_longlong;
}
extern "C" {
    pub fn _strtoll_l(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_longlong;
}
extern "C" {
    pub fn strtoul(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> cty::c_ulong;
}
extern "C" {
    pub fn _strtoul_l(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_ulong;
}
extern "C" {
    pub fn strtoull(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn _strtoull_l(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn _strtoi64(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> cty::c_longlong;
}
extern "C" {
    pub fn _strtoi64_l(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_longlong;
}
extern "C" {
    pub fn _strtoui64(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn _strtoui64_l(
        _String: *const cty::c_char,
        _EndPtr: *mut *mut cty::c_char,
        _Radix: cty::c_int,
        _Locale: _locale_t,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn _itoa_s(
        _Value: cty::c_int,
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Radix: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _itoa(
        _Value: cty::c_int,
        _Buffer: *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn _ltoa_s(
        _Value: cty::c_long,
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Radix: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ltoa(
        _Value: cty::c_long,
        _Buffer: *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn _ultoa_s(
        _Value: cty::c_ulong,
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Radix: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ultoa(
        _Value: cty::c_ulong,
        _Buffer: *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn _i64toa_s(
        _Value: cty::c_longlong,
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Radix: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _i64toa(
        _Value: cty::c_longlong,
        _Buffer: *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn _ui64toa_s(
        _Value: cty::c_ulonglong,
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Radix: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ui64toa(
        _Value: cty::c_ulonglong,
        _Buffer: *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn _ecvt_s(
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Value: f64,
        _DigitCount: cty::c_int,
        _PtDec: *mut cty::c_int,
        _PtSign: *mut cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _ecvt(
        _Value: f64,
        _DigitCount: cty::c_int,
        _PtDec: *mut cty::c_int,
        _PtSign: *mut cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn _fcvt_s(
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Value: f64,
        _FractionalDigitCount: cty::c_int,
        _PtDec: *mut cty::c_int,
        _PtSign: *mut cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _fcvt(
        _Value: f64,
        _FractionalDigitCount: cty::c_int,
        _PtDec: *mut cty::c_int,
        _PtSign: *mut cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn _gcvt_s(
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Value: f64,
        _DigitCount: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _gcvt(
        _Value: f64,
        _DigitCount: cty::c_int,
        _Buffer: *mut cty::c_char,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn ___mb_cur_max_func() -> cty::c_int;
}
extern "C" {
    pub fn ___mb_cur_max_l_func(_Locale: _locale_t) -> cty::c_int;
}
extern "C" {
    pub fn mblen(_Ch: *const cty::c_char, _MaxCount: usize) -> cty::c_int;
}
extern "C" {
    pub fn _mblen_l(_Ch: *const cty::c_char, _MaxCount: usize, _Locale: _locale_t) -> cty::c_int;
}
extern "C" {
    pub fn _mbstrlen(_String: *const cty::c_char) -> usize;
}
extern "C" {
    pub fn _mbstrlen_l(_String: *const cty::c_char, _Locale: _locale_t) -> usize;
}
extern "C" {
    pub fn _mbstrnlen(_String: *const cty::c_char, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _mbstrnlen_l(_String: *const cty::c_char, _MaxCount: usize, _Locale: _locale_t)
        -> usize;
}
extern "C" {
    pub fn mbtowc(
        _DstCh: *mut wchar_t,
        _SrcCh: *const cty::c_char,
        _SrcSizeInBytes: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _mbtowc_l(
        _DstCh: *mut wchar_t,
        _SrcCh: *const cty::c_char,
        _SrcSizeInBytes: usize,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn mbstowcs_s(
        _PtNumOfCharConverted: *mut usize,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _SrcBuf: *const cty::c_char,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn mbstowcs(_Dest: *mut wchar_t, _Source: *const cty::c_char, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _mbstowcs_s_l(
        _PtNumOfCharConverted: *mut usize,
        _DstBuf: *mut wchar_t,
        _SizeInWords: usize,
        _SrcBuf: *const cty::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _mbstowcs_l(
        _Dest: *mut wchar_t,
        _Source: *const cty::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn wctomb(_MbCh: *mut cty::c_char, _WCh: wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn _wctomb_l(_MbCh: *mut cty::c_char, _WCh: wchar_t, _Locale: _locale_t) -> cty::c_int;
}
extern "C" {
    pub fn wctomb_s(
        _SizeConverted: *mut cty::c_int,
        _MbCh: *mut cty::c_char,
        _SizeInBytes: rsize_t,
        _WCh: wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wctomb_s_l(
        _SizeConverted: *mut cty::c_int,
        _MbCh: *mut cty::c_char,
        _SizeInBytes: usize,
        _WCh: wchar_t,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstombs_s(
        _PtNumOfCharConverted: *mut usize,
        _Dst: *mut cty::c_char,
        _DstSizeInBytes: usize,
        _Src: *const wchar_t,
        _MaxCountInBytes: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstombs(_Dest: *mut cty::c_char, _Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _wcstombs_s_l(
        _PtNumOfCharConverted: *mut usize,
        _Dst: *mut cty::c_char,
        _DstSizeInBytes: usize,
        _Src: *const wchar_t,
        _MaxCountInBytes: usize,
        _Locale: _locale_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcstombs_l(
        _Dest: *mut cty::c_char,
        _Source: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn _fullpath(
        _Buffer: *mut cty::c_char,
        _Path: *const cty::c_char,
        _BufferCount: usize,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn _makepath_s(
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Drive: *const cty::c_char,
        _Dir: *const cty::c_char,
        _Filename: *const cty::c_char,
        _Ext: *const cty::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn _makepath(
        _Buffer: *mut cty::c_char,
        _Drive: *const cty::c_char,
        _Dir: *const cty::c_char,
        _Filename: *const cty::c_char,
        _Ext: *const cty::c_char,
    );
}
extern "C" {
    pub fn _splitpath(
        _FullPath: *const cty::c_char,
        _Drive: *mut cty::c_char,
        _Dir: *mut cty::c_char,
        _Filename: *mut cty::c_char,
        _Ext: *mut cty::c_char,
    );
}
extern "C" {
    pub fn _splitpath_s(
        _FullPath: *const cty::c_char,
        _Drive: *mut cty::c_char,
        _DriveCount: usize,
        _Dir: *mut cty::c_char,
        _DirCount: usize,
        _Filename: *mut cty::c_char,
        _FilenameCount: usize,
        _Ext: *mut cty::c_char,
        _ExtCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn getenv_s(
        _RequiredCount: *mut usize,
        _Buffer: *mut cty::c_char,
        _BufferCount: rsize_t,
        _VarName: *const cty::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn __p___argc() -> *mut cty::c_int;
}
extern "C" {
    pub fn __p___argv() -> *mut *mut *mut cty::c_char;
}
extern "C" {
    pub fn __p___wargv() -> *mut *mut *mut wchar_t;
}
extern "C" {
    pub fn __p__environ() -> *mut *mut *mut cty::c_char;
}
extern "C" {
    pub fn __p__wenviron() -> *mut *mut *mut wchar_t;
}
extern "C" {
    pub fn getenv(_VarName: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn _dupenv_s(
        _Buffer: *mut *mut cty::c_char,
        _BufferCount: *mut usize,
        _VarName: *const cty::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn system(_Command: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn _putenv(_EnvString: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn _putenv_s(_Name: *const cty::c_char, _Value: *const cty::c_char) -> errno_t;
}
extern "C" {
    pub fn _searchenv_s(
        _Filename: *const cty::c_char,
        _VarName: *const cty::c_char,
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _searchenv(
        _Filename: *const cty::c_char,
        _VarName: *const cty::c_char,
        _Buffer: *mut cty::c_char,
    );
}
extern "C" {
    pub fn _seterrormode(_Mode: cty::c_int);
}
extern "C" {
    pub fn _beep(_Frequency: cty::c_uint, _Duration: cty::c_uint);
}
extern "C" {
    pub fn _sleep(_Duration: cty::c_ulong);
}
extern "C" {
    pub fn ecvt(
        _Value: f64,
        _DigitCount: cty::c_int,
        _PtDec: *mut cty::c_int,
        _PtSign: *mut cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn fcvt(
        _Value: f64,
        _FractionalDigitCount: cty::c_int,
        _PtDec: *mut cty::c_int,
        _PtSign: *mut cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn gcvt(
        _Value: f64,
        _DigitCount: cty::c_int,
        _DstBuf: *mut cty::c_char,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn itoa(
        _Value: cty::c_int,
        _Buffer: *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn ltoa(
        _Value: cty::c_long,
        _Buffer: *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn swab(_Buf1: *mut cty::c_char, _Buf2: *mut cty::c_char, _SizeInBytes: cty::c_int);
}
extern "C" {
    pub fn ultoa(
        _Value: cty::c_ulong,
        _Buffer: *mut cty::c_char,
        _Radix: cty::c_int,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn putenv(_EnvString: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn onexit(_Func: _onexit_t) -> _onexit_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct _iobuf {
    pub _Placeholder: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout__iobuf() {
    const UNINIT: ::core::mem::MaybeUninit<_iobuf> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<_iobuf>(),
        8usize,
        concat!("Size of: ", stringify!(_iobuf))
    );
    assert_eq!(
        ::core::mem::align_of::<_iobuf>(),
        8usize,
        concat!("Alignment of ", stringify!(_iobuf))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr)._Placeholder) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_iobuf),
            "::",
            stringify!(_Placeholder)
        )
    );
}
impl Default for _iobuf {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type FILE = _iobuf;
extern "C" {
    pub fn __acrt_iob_func(_Ix: cty::c_uint) -> *mut FILE;
}
extern "C" {
    pub fn fgetwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fgetwchar() -> wint_t;
}
extern "C" {
    pub fn fputwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fputwchar(_Character: wchar_t) -> wint_t;
}
extern "C" {
    pub fn getwc(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn getwchar() -> wint_t;
}
extern "C" {
    pub fn fgetws(
        _Buffer: *mut wchar_t,
        _BufferCount: cty::c_int,
        _Stream: *mut FILE,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn fputws(_Buffer: *const wchar_t, _Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _getws_s(_Buffer: *mut wchar_t, _BufferCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn putwc(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn putwchar(_Character: wchar_t) -> wint_t;
}
extern "C" {
    pub fn _putws(_Buffer: *const wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn ungetwc(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _wfdopen(_FileHandle: cty::c_int, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wfopen(_FileName: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wfopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wfreopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _wfreopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
extern "C" {
    pub fn _wfsopen(
        _FileName: *const wchar_t,
        _Mode: *const wchar_t,
        _ShFlag: cty::c_int,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _wpopen(_Command: *const wchar_t, _Mode: *const wchar_t) -> *mut FILE;
}
extern "C" {
    pub fn _wremove(_FileName: *const wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn _wtempnam(_Directory: *const wchar_t, _FilePrefix: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wtmpnam_s(_Buffer: *mut wchar_t, _BufferCount: usize) -> errno_t;
}
extern "C" {
    pub fn _wtmpnam(_Buffer: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _fgetwc_nolock(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _fputwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _getwc_nolock(_Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _putwc_nolock(_Character: wchar_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn _ungetwc_nolock(_Character: wint_t, _Stream: *mut FILE) -> wint_t;
}
extern "C" {
    pub fn __stdio_common_vfwprintf(
        _Options: cty::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwprintf_s(
        _Options: cty::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwprintf_p(
        _Options: cty::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vfwscanf(
        _Options: cty::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf(
        _Options: cty::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf_s(
        _Options: cty::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vsnwprintf_s(
        _Options: cty::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _MaxCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vswprintf_p(
        _Options: cty::c_ulonglong,
        _Buffer: *mut wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vswscanf(
        _Options: cty::c_ulonglong,
        _Buffer: *const wchar_t,
        _BufferCount: usize,
        _Format: *const wchar_t,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
pub type fpos_t = cty::c_longlong;
extern "C" {
    pub fn _get_stream_buffer_pointers(
        _Stream: *mut FILE,
        _Base: *mut *mut *mut cty::c_char,
        _Pointer: *mut *mut *mut cty::c_char,
        _Count: *mut *mut cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn clearerr_s(_Stream: *mut FILE) -> errno_t;
}
extern "C" {
    pub fn fopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const cty::c_char,
        _Mode: *const cty::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn fread_s(
        _Buffer: *mut cty::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn freopen_s(
        _Stream: *mut *mut FILE,
        _FileName: *const cty::c_char,
        _Mode: *const cty::c_char,
        _OldStream: *mut FILE,
    ) -> errno_t;
}
extern "C" {
    pub fn gets_s(_Buffer: *mut cty::c_char, _Size: rsize_t) -> *mut cty::c_char;
}
extern "C" {
    pub fn tmpfile_s(_Stream: *mut *mut FILE) -> errno_t;
}
extern "C" {
    pub fn tmpnam_s(_Buffer: *mut cty::c_char, _Size: rsize_t) -> errno_t;
}
extern "C" {
    pub fn clearerr(_Stream: *mut FILE);
}
extern "C" {
    pub fn fclose(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _fcloseall() -> cty::c_int;
}
extern "C" {
    pub fn _fdopen(_FileHandle: cty::c_int, _Mode: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn feof(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn ferror(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fflush(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fgetc(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _fgetchar() -> cty::c_int;
}
extern "C" {
    pub fn fgetpos(_Stream: *mut FILE, _Position: *mut fpos_t) -> cty::c_int;
}
extern "C" {
    pub fn fgets(
        _Buffer: *mut cty::c_char,
        _MaxCount: cty::c_int,
        _Stream: *mut FILE,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn _fileno(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _flushall() -> cty::c_int;
}
extern "C" {
    pub fn fopen(_FileName: *const cty::c_char, _Mode: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fputc(_Character: cty::c_int, _Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _fputchar(_Character: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn fputs(_Buffer: *const cty::c_char, _Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn fread(
        _Buffer: *mut cty::c_void,
        _ElementSize: cty::c_ulonglong,
        _ElementCount: cty::c_ulonglong,
        _Stream: *mut FILE,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn freopen(
        _FileName: *const cty::c_char,
        _Mode: *const cty::c_char,
        _Stream: *mut FILE,
    ) -> *mut FILE;
}
extern "C" {
    pub fn _fsopen(
        _FileName: *const cty::c_char,
        _Mode: *const cty::c_char,
        _ShFlag: cty::c_int,
    ) -> *mut FILE;
}
extern "C" {
    pub fn fsetpos(_Stream: *mut FILE, _Position: *const fpos_t) -> cty::c_int;
}
extern "C" {
    pub fn fseek(_Stream: *mut FILE, _Offset: cty::c_long, _Origin: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn _fseeki64(
        _Stream: *mut FILE,
        _Offset: cty::c_longlong,
        _Origin: cty::c_int,
    ) -> cty::c_int;
}
extern "C" {
    pub fn ftell(_Stream: *mut FILE) -> cty::c_long;
}
extern "C" {
    pub fn _ftelli64(_Stream: *mut FILE) -> cty::c_longlong;
}
extern "C" {
    pub fn fwrite(
        _Buffer: *const cty::c_void,
        _ElementSize: cty::c_ulonglong,
        _ElementCount: cty::c_ulonglong,
        _Stream: *mut FILE,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn getc(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn getchar() -> cty::c_int;
}
extern "C" {
    pub fn _getmaxstdio() -> cty::c_int;
}
extern "C" {
    pub fn _getw(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _pclose(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _popen(_Command: *const cty::c_char, _Mode: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn putc(_Character: cty::c_int, _Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putchar(_Character: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn puts(_Buffer: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn _putw(_Word: cty::c_int, _Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn remove(_FileName: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn rename(_OldFileName: *const cty::c_char, _NewFileName: *const cty::c_char)
        -> cty::c_int;
}
extern "C" {
    pub fn _unlink(_FileName: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn unlink(_FileName: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn rewind(_Stream: *mut FILE);
}
extern "C" {
    pub fn _rmtmp() -> cty::c_int;
}
extern "C" {
    pub fn setbuf(_Stream: *mut FILE, _Buffer: *mut cty::c_char);
}
extern "C" {
    pub fn _setmaxstdio(_Maximum: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn setvbuf(
        _Stream: *mut FILE,
        _Buffer: *mut cty::c_char,
        _Mode: cty::c_int,
        _Size: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _tempnam(
        _DirectoryName: *const cty::c_char,
        _FilePrefix: *const cty::c_char,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn tmpfile() -> *mut FILE;
}
extern "C" {
    pub fn tmpnam(_Buffer: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn ungetc(_Character: cty::c_int, _Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _lock_file(_Stream: *mut FILE);
}
extern "C" {
    pub fn _unlock_file(_Stream: *mut FILE);
}
extern "C" {
    pub fn _fclose_nolock(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _fflush_nolock(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _fgetc_nolock(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _fputc_nolock(_Character: cty::c_int, _Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _fread_nolock(
        _Buffer: *mut cty::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fread_nolock_s(
        _Buffer: *mut cty::c_void,
        _BufferSize: usize,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _fseek_nolock(
        _Stream: *mut FILE,
        _Offset: cty::c_long,
        _Origin: cty::c_int,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _fseeki64_nolock(
        _Stream: *mut FILE,
        _Offset: cty::c_longlong,
        _Origin: cty::c_int,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _ftell_nolock(_Stream: *mut FILE) -> cty::c_long;
}
extern "C" {
    pub fn _ftelli64_nolock(_Stream: *mut FILE) -> cty::c_longlong;
}
extern "C" {
    pub fn _fwrite_nolock(
        _Buffer: *const cty::c_void,
        _ElementSize: usize,
        _ElementCount: usize,
        _Stream: *mut FILE,
    ) -> usize;
}
extern "C" {
    pub fn _getc_nolock(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _putc_nolock(_Character: cty::c_int, _Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn _ungetc_nolock(_Character: cty::c_int, _Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn __p__commode() -> *mut cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf(
        _Options: cty::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const cty::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf_s(
        _Options: cty::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const cty::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vfprintf_p(
        _Options: cty::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const cty::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _set_printf_count_output(_Value: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn _get_printf_count_output() -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vfscanf(
        _Options: cty::c_ulonglong,
        _Stream: *mut FILE,
        _Format: *const cty::c_char,
        _Locale: _locale_t,
        _Arglist: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf(
        _Options: cty::c_ulonglong,
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Format: *const cty::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf_s(
        _Options: cty::c_ulonglong,
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Format: *const cty::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vsnprintf_s(
        _Options: cty::c_ulonglong,
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _MaxCount: usize,
        _Format: *const cty::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vsprintf_p(
        _Options: cty::c_ulonglong,
        _Buffer: *mut cty::c_char,
        _BufferCount: usize,
        _Format: *const cty::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __stdio_common_vsscanf(
        _Options: cty::c_ulonglong,
        _Buffer: *const cty::c_char,
        _BufferCount: usize,
        _Format: *const cty::c_char,
        _Locale: _locale_t,
        _ArgList: va_list,
    ) -> cty::c_int;
}
extern "C" {
    pub fn tempnam(
        _Directory: *const cty::c_char,
        _FilePrefix: *const cty::c_char,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn fcloseall() -> cty::c_int;
}
extern "C" {
    pub fn fdopen(_FileHandle: cty::c_int, _Format: *const cty::c_char) -> *mut FILE;
}
extern "C" {
    pub fn fgetchar() -> cty::c_int;
}
extern "C" {
    pub fn fileno(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn flushall() -> cty::c_int;
}
extern "C" {
    pub fn fputchar(_Ch: cty::c_int) -> cty::c_int;
}
extern "C" {
    pub fn getw(_Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn putw(_Ch: cty::c_int, _Stream: *mut FILE) -> cty::c_int;
}
extern "C" {
    pub fn rmtmp() -> cty::c_int;
}
extern "C" {
    pub fn memchr(
        _Buf: *const cty::c_void,
        _Val: cty::c_int,
        _MaxCount: cty::c_ulonglong,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn memcmp(
        _Buf1: *const cty::c_void,
        _Buf2: *const cty::c_void,
        _Size: cty::c_ulonglong,
    ) -> cty::c_int;
}
extern "C" {
    pub fn memcpy(
        _Dst: *mut cty::c_void,
        _Src: *const cty::c_void,
        _Size: cty::c_ulonglong,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn memmove(
        _Dst: *mut cty::c_void,
        _Src: *const cty::c_void,
        _Size: cty::c_ulonglong,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn memset(
        _Dst: *mut cty::c_void,
        _Val: cty::c_int,
        _Size: cty::c_ulonglong,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn strchr(_Str: *const cty::c_char, _Val: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn strrchr(_Str: *const cty::c_char, _Ch: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn strstr(_Str: *const cty::c_char, _SubStr: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn wcschr(_Str: *const cty::c_ushort, _Ch: cty::c_ushort) -> *mut cty::c_ushort;
}
extern "C" {
    pub fn wcsrchr(_Str: *const wchar_t, _Ch: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsstr(_Str: *const wchar_t, _SubStr: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _memicmp(
        _Buf1: *const cty::c_void,
        _Buf2: *const cty::c_void,
        _Size: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _memicmp_l(
        _Buf1: *const cty::c_void,
        _Buf2: *const cty::c_void,
        _Size: usize,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn memccpy(
        _Dst: *mut cty::c_void,
        _Src: *const cty::c_void,
        _Val: cty::c_int,
        _Size: cty::c_ulonglong,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn memicmp(
        _Buf1: *const cty::c_void,
        _Buf2: *const cty::c_void,
        _Size: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn wcscat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcscpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsncat_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcsncpy_s(
        _Destination: *mut wchar_t,
        _SizeInWords: rsize_t,
        _Source: *const wchar_t,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn wcstok_s(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscat(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscmp(_String1: *const cty::c_ushort, _String2: *const cty::c_ushort) -> cty::c_int;
}
extern "C" {
    pub fn wcscpy(_Destination: *mut wchar_t, _Source: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcscspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcslen(_String: *const cty::c_ushort) -> cty::c_ulonglong;
}
extern "C" {
    pub fn wcsnlen(_Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn wcsncat(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsncmp(
        _String1: *const cty::c_ushort,
        _String2: *const cty::c_ushort,
        _MaxCount: cty::c_ulonglong,
    ) -> cty::c_int;
}
extern "C" {
    pub fn wcsncpy(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _Count: usize,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn wcspbrk(_String: *const wchar_t, _Control: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsspn(_String: *const wchar_t, _Control: *const wchar_t) -> usize;
}
extern "C" {
    pub fn wcstok(
        _String: *mut wchar_t,
        _Delimiter: *const wchar_t,
        _Context: *mut *mut wchar_t,
    ) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcserror(_ErrorNumber: cty::c_int) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcserror_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _ErrorNumber: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn __wcserror(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn __wcserror_s(
        _Buffer: *mut wchar_t,
        _SizeInWords: usize,
        _ErrorMessage: *const wchar_t,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn _wcsicmp_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _wcsnicmp_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _wcsnset_s(
        _Destination: *mut wchar_t,
        _SizeInWords: usize,
        _Value: wchar_t,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsset_s(_Destination: *mut wchar_t, _SizeInWords: usize, _Value: wchar_t) -> errno_t;
}
extern "C" {
    pub fn _wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcslwr_s(_String: *mut wchar_t, _SizeInWords: usize) -> errno_t;
}
extern "C" {
    pub fn _wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcslwr_s_l(_String: *mut wchar_t, _SizeInWords: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _wcslwr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsupr_s(_String: *mut wchar_t, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn _wcsupr_s_l(_String: *mut wchar_t, _Size: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _wcsupr_l(_String: *mut wchar_t, _Locale: _locale_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsxfrm(_Destination: *mut wchar_t, _Source: *const wchar_t, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _wcsxfrm_l(
        _Destination: *mut wchar_t,
        _Source: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn wcscoll(_String1: *const wchar_t, _String2: *const wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn _wcscoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn _wcsicoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _wcsncoll(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _wcsncoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _wcsnicoll(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _wcsnicoll_l(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn wcsdup(_String: *const wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsicmp(_String1: *const wchar_t, _String2: *const wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn wcsnicmp(
        _String1: *const wchar_t,
        _String2: *const wchar_t,
        _MaxCount: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn wcsnset(_String: *mut wchar_t, _Value: wchar_t, _MaxCount: usize) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsrev(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsset(_String: *mut wchar_t, _Value: wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcslwr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsupr(_String: *mut wchar_t) -> *mut wchar_t;
}
extern "C" {
    pub fn wcsicoll(_String1: *const wchar_t, _String2: *const wchar_t) -> cty::c_int;
}
extern "C" {
    pub fn strcpy_s(
        _Destination: *mut cty::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const cty::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strcat_s(
        _Destination: *mut cty::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const cty::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strerror_s(
        _Buffer: *mut cty::c_char,
        _SizeInBytes: usize,
        _ErrorNumber: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn strncat_s(
        _Destination: *mut cty::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const cty::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn strncpy_s(
        _Destination: *mut cty::c_char,
        _SizeInBytes: rsize_t,
        _Source: *const cty::c_char,
        _MaxCount: rsize_t,
    ) -> errno_t;
}
extern "C" {
    pub fn strtok_s(
        _String: *mut cty::c_char,
        _Delimiter: *const cty::c_char,
        _Context: *mut *mut cty::c_char,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn _memccpy(
        _Dst: *mut cty::c_void,
        _Src: *const cty::c_void,
        _Val: cty::c_int,
        _MaxCount: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn strcat(_Destination: *mut cty::c_char, _Source: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn strcmp(_Str1: *const cty::c_char, _Str2: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn _strcmpi(_String1: *const cty::c_char, _String2: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn strcoll(_String1: *const cty::c_char, _String2: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn _strcoll_l(
        _String1: *const cty::c_char,
        _String2: *const cty::c_char,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn strcpy(_Destination: *mut cty::c_char, _Source: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn strcspn(_Str: *const cty::c_char, _Control: *const cty::c_char) -> cty::c_ulonglong;
}
extern "C" {
    pub fn _strdup(_Source: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn _strerror(_ErrorMessage: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn _strerror_s(
        _Buffer: *mut cty::c_char,
        _SizeInBytes: usize,
        _ErrorMessage: *const cty::c_char,
    ) -> errno_t;
}
extern "C" {
    pub fn strerror(_ErrorMessage: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn _stricmp(_String1: *const cty::c_char, _String2: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn _stricoll(_String1: *const cty::c_char, _String2: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn _stricoll_l(
        _String1: *const cty::c_char,
        _String2: *const cty::c_char,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _stricmp_l(
        _String1: *const cty::c_char,
        _String2: *const cty::c_char,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn strlen(_Str: *const cty::c_char) -> cty::c_ulonglong;
}
extern "C" {
    pub fn _strlwr_s(_String: *mut cty::c_char, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _strlwr(_String: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn _strlwr_s_l(_String: *mut cty::c_char, _Size: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _strlwr_l(_String: *mut cty::c_char, _Locale: _locale_t) -> *mut cty::c_char;
}
extern "C" {
    pub fn strncat(
        _Destination: *mut cty::c_char,
        _Source: *const cty::c_char,
        _Count: cty::c_ulonglong,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn strncmp(
        _Str1: *const cty::c_char,
        _Str2: *const cty::c_char,
        _MaxCount: cty::c_ulonglong,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _strnicmp(
        _String1: *const cty::c_char,
        _String2: *const cty::c_char,
        _MaxCount: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _strnicmp_l(
        _String1: *const cty::c_char,
        _String2: *const cty::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _strnicoll(
        _String1: *const cty::c_char,
        _String2: *const cty::c_char,
        _MaxCount: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _strnicoll_l(
        _String1: *const cty::c_char,
        _String2: *const cty::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _strncoll(
        _String1: *const cty::c_char,
        _String2: *const cty::c_char,
        _MaxCount: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn _strncoll_l(
        _String1: *const cty::c_char,
        _String2: *const cty::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> cty::c_int;
}
extern "C" {
    pub fn __strncnt(_String: *const cty::c_char, _Count: usize) -> usize;
}
extern "C" {
    pub fn strncpy(
        _Destination: *mut cty::c_char,
        _Source: *const cty::c_char,
        _Count: cty::c_ulonglong,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn strnlen(_String: *const cty::c_char, _MaxCount: usize) -> usize;
}
extern "C" {
    pub fn _strnset_s(
        _String: *mut cty::c_char,
        _SizeInBytes: usize,
        _Value: cty::c_int,
        _MaxCount: usize,
    ) -> errno_t;
}
extern "C" {
    pub fn _strnset(
        _Destination: *mut cty::c_char,
        _Value: cty::c_int,
        _Count: usize,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn strpbrk(_Str: *const cty::c_char, _Control: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn _strrev(_Str: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn _strset_s(
        _Destination: *mut cty::c_char,
        _DestinationSize: usize,
        _Value: cty::c_int,
    ) -> errno_t;
}
extern "C" {
    pub fn _strset(_Destination: *mut cty::c_char, _Value: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn strspn(_Str: *const cty::c_char, _Control: *const cty::c_char) -> cty::c_ulonglong;
}
extern "C" {
    pub fn strtok(_String: *mut cty::c_char, _Delimiter: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn _strupr_s(_String: *mut cty::c_char, _Size: usize) -> errno_t;
}
extern "C" {
    pub fn _strupr(_String: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn _strupr_s_l(_String: *mut cty::c_char, _Size: usize, _Locale: _locale_t) -> errno_t;
}
extern "C" {
    pub fn _strupr_l(_String: *mut cty::c_char, _Locale: _locale_t) -> *mut cty::c_char;
}
extern "C" {
    pub fn strxfrm(
        _Destination: *mut cty::c_char,
        _Source: *const cty::c_char,
        _MaxCount: cty::c_ulonglong,
    ) -> cty::c_ulonglong;
}
extern "C" {
    pub fn _strxfrm_l(
        _Destination: *mut cty::c_char,
        _Source: *const cty::c_char,
        _MaxCount: usize,
        _Locale: _locale_t,
    ) -> usize;
}
extern "C" {
    pub fn strdup(_String: *const cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn strcmpi(_String1: *const cty::c_char, _String2: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn stricmp(_String1: *const cty::c_char, _String2: *const cty::c_char) -> cty::c_int;
}
extern "C" {
    pub fn strlwr(_String: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn strnicmp(
        _String1: *const cty::c_char,
        _String2: *const cty::c_char,
        _MaxCount: usize,
    ) -> cty::c_int;
}
extern "C" {
    pub fn strnset(
        _String: *mut cty::c_char,
        _Value: cty::c_int,
        _MaxCount: usize,
    ) -> *mut cty::c_char;
}
extern "C" {
    pub fn strrev(_String: *mut cty::c_char) -> *mut cty::c_char;
}
extern "C" {
    pub fn strset(_String: *mut cty::c_char, _Value: cty::c_int) -> *mut cty::c_char;
}
extern "C" {
    pub fn strupr(_String: *mut cty::c_char) -> *mut cty::c_char;
}
pub const lexbor_status_t_LXB_STATUS_OK: lexbor_status_t = 0;
pub const lexbor_status_t_LXB_STATUS_ERROR: lexbor_status_t = 1;
pub const lexbor_status_t_LXB_STATUS_ERROR_MEMORY_ALLOCATION: lexbor_status_t = 2;
pub const lexbor_status_t_LXB_STATUS_ERROR_OBJECT_IS_NULL: lexbor_status_t = 3;
pub const lexbor_status_t_LXB_STATUS_ERROR_SMALL_BUFFER: lexbor_status_t = 4;
pub const lexbor_status_t_LXB_STATUS_ERROR_INCOMPLETE_OBJECT: lexbor_status_t = 5;
pub const lexbor_status_t_LXB_STATUS_ERROR_NO_FREE_SLOT: lexbor_status_t = 6;
pub const lexbor_status_t_LXB_STATUS_ERROR_TOO_SMALL_SIZE: lexbor_status_t = 7;
pub const lexbor_status_t_LXB_STATUS_ERROR_NOT_EXISTS: lexbor_status_t = 8;
pub const lexbor_status_t_LXB_STATUS_ERROR_WRONG_ARGS: lexbor_status_t = 9;
pub const lexbor_status_t_LXB_STATUS_ERROR_WRONG_STAGE: lexbor_status_t = 10;
pub const lexbor_status_t_LXB_STATUS_ERROR_UNEXPECTED_RESULT: lexbor_status_t = 11;
pub const lexbor_status_t_LXB_STATUS_ERROR_UNEXPECTED_DATA: lexbor_status_t = 12;
pub const lexbor_status_t_LXB_STATUS_ERROR_OVERFLOW: lexbor_status_t = 13;
pub const lexbor_status_t_LXB_STATUS_CONTINUE: lexbor_status_t = 14;
pub const lexbor_status_t_LXB_STATUS_SMALL_BUFFER: lexbor_status_t = 15;
pub const lexbor_status_t_LXB_STATUS_ABORTED: lexbor_status_t = 16;
pub const lexbor_status_t_LXB_STATUS_STOPPED: lexbor_status_t = 17;
pub const lexbor_status_t_LXB_STATUS_NEXT: lexbor_status_t = 18;
pub const lexbor_status_t_LXB_STATUS_STOP: lexbor_status_t = 19;
pub const lexbor_status_t_LXB_STATUS_WARNING: lexbor_status_t = 20;
pub type lexbor_status_t = cty::c_int;
pub const lexbor_action_t_LEXBOR_ACTION_OK: lexbor_action_t = 0;
pub const lexbor_action_t_LEXBOR_ACTION_STOP: lexbor_action_t = 1;
pub const lexbor_action_t_LEXBOR_ACTION_NEXT: lexbor_action_t = 2;
pub type lexbor_action_t = cty::c_int;
pub type lexbor_serialize_cb_f = ::core::option::Option<
    unsafe extern "C" fn(
        data: *const lxb_char_t,
        len: usize,
        ctx: *mut cty::c_void,
    ) -> lxb_status_t,
>;
pub type lexbor_serialize_cb_cp_f = ::core::option::Option<
    unsafe extern "C" fn(
        cps: *const lxb_codepoint_t,
        len: usize,
        ctx: *mut cty::c_void,
    ) -> lxb_status_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_serialize_ctx_t {
    pub cb: lexbor_serialize_cb_f,
    pub ctx: *mut cty::c_void,
    pub opt: isize,
    pub count: usize,
}
#[test]
fn bindgen_test_layout_lexbor_serialize_ctx_t() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_serialize_ctx_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_serialize_ctx_t>(),
        32usize,
        concat!("Size of: ", stringify!(lexbor_serialize_ctx_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_serialize_ctx_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_serialize_ctx_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cb) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_serialize_ctx_t),
            "::",
            stringify!(cb)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ctx) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_serialize_ctx_t),
            "::",
            stringify!(ctx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).opt) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_serialize_ctx_t),
            "::",
            stringify!(opt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_serialize_ctx_t),
            "::",
            stringify!(count)
        )
    );
}
impl Default for lexbor_serialize_ctx_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type lxb_tag_id_t = usize;
pub const lxb_tag_id_enum_t_LXB_TAG__UNDEF: lxb_tag_id_enum_t = 0;
pub const lxb_tag_id_enum_t_LXB_TAG__END_OF_FILE: lxb_tag_id_enum_t = 1;
pub const lxb_tag_id_enum_t_LXB_TAG__TEXT: lxb_tag_id_enum_t = 2;
pub const lxb_tag_id_enum_t_LXB_TAG__DOCUMENT: lxb_tag_id_enum_t = 3;
pub const lxb_tag_id_enum_t_LXB_TAG__EM_COMMENT: lxb_tag_id_enum_t = 4;
pub const lxb_tag_id_enum_t_LXB_TAG__EM_DOCTYPE: lxb_tag_id_enum_t = 5;
pub const lxb_tag_id_enum_t_LXB_TAG_A: lxb_tag_id_enum_t = 6;
pub const lxb_tag_id_enum_t_LXB_TAG_ABBR: lxb_tag_id_enum_t = 7;
pub const lxb_tag_id_enum_t_LXB_TAG_ACRONYM: lxb_tag_id_enum_t = 8;
pub const lxb_tag_id_enum_t_LXB_TAG_ADDRESS: lxb_tag_id_enum_t = 9;
pub const lxb_tag_id_enum_t_LXB_TAG_ALTGLYPH: lxb_tag_id_enum_t = 10;
pub const lxb_tag_id_enum_t_LXB_TAG_ALTGLYPHDEF: lxb_tag_id_enum_t = 11;
pub const lxb_tag_id_enum_t_LXB_TAG_ALTGLYPHITEM: lxb_tag_id_enum_t = 12;
pub const lxb_tag_id_enum_t_LXB_TAG_ANIMATECOLOR: lxb_tag_id_enum_t = 13;
pub const lxb_tag_id_enum_t_LXB_TAG_ANIMATEMOTION: lxb_tag_id_enum_t = 14;
pub const lxb_tag_id_enum_t_LXB_TAG_ANIMATETRANSFORM: lxb_tag_id_enum_t = 15;
pub const lxb_tag_id_enum_t_LXB_TAG_ANNOTATION_XML: lxb_tag_id_enum_t = 16;
pub const lxb_tag_id_enum_t_LXB_TAG_APPLET: lxb_tag_id_enum_t = 17;
pub const lxb_tag_id_enum_t_LXB_TAG_AREA: lxb_tag_id_enum_t = 18;
pub const lxb_tag_id_enum_t_LXB_TAG_ARTICLE: lxb_tag_id_enum_t = 19;
pub const lxb_tag_id_enum_t_LXB_TAG_ASIDE: lxb_tag_id_enum_t = 20;
pub const lxb_tag_id_enum_t_LXB_TAG_AUDIO: lxb_tag_id_enum_t = 21;
pub const lxb_tag_id_enum_t_LXB_TAG_B: lxb_tag_id_enum_t = 22;
pub const lxb_tag_id_enum_t_LXB_TAG_BASE: lxb_tag_id_enum_t = 23;
pub const lxb_tag_id_enum_t_LXB_TAG_BASEFONT: lxb_tag_id_enum_t = 24;
pub const lxb_tag_id_enum_t_LXB_TAG_BDI: lxb_tag_id_enum_t = 25;
pub const lxb_tag_id_enum_t_LXB_TAG_BDO: lxb_tag_id_enum_t = 26;
pub const lxb_tag_id_enum_t_LXB_TAG_BGSOUND: lxb_tag_id_enum_t = 27;
pub const lxb_tag_id_enum_t_LXB_TAG_BIG: lxb_tag_id_enum_t = 28;
pub const lxb_tag_id_enum_t_LXB_TAG_BLINK: lxb_tag_id_enum_t = 29;
pub const lxb_tag_id_enum_t_LXB_TAG_BLOCKQUOTE: lxb_tag_id_enum_t = 30;
pub const lxb_tag_id_enum_t_LXB_TAG_BODY: lxb_tag_id_enum_t = 31;
pub const lxb_tag_id_enum_t_LXB_TAG_BR: lxb_tag_id_enum_t = 32;
pub const lxb_tag_id_enum_t_LXB_TAG_BUTTON: lxb_tag_id_enum_t = 33;
pub const lxb_tag_id_enum_t_LXB_TAG_CANVAS: lxb_tag_id_enum_t = 34;
pub const lxb_tag_id_enum_t_LXB_TAG_CAPTION: lxb_tag_id_enum_t = 35;
pub const lxb_tag_id_enum_t_LXB_TAG_CENTER: lxb_tag_id_enum_t = 36;
pub const lxb_tag_id_enum_t_LXB_TAG_CITE: lxb_tag_id_enum_t = 37;
pub const lxb_tag_id_enum_t_LXB_TAG_CLIPPATH: lxb_tag_id_enum_t = 38;
pub const lxb_tag_id_enum_t_LXB_TAG_CODE: lxb_tag_id_enum_t = 39;
pub const lxb_tag_id_enum_t_LXB_TAG_COL: lxb_tag_id_enum_t = 40;
pub const lxb_tag_id_enum_t_LXB_TAG_COLGROUP: lxb_tag_id_enum_t = 41;
pub const lxb_tag_id_enum_t_LXB_TAG_DATA: lxb_tag_id_enum_t = 42;
pub const lxb_tag_id_enum_t_LXB_TAG_DATALIST: lxb_tag_id_enum_t = 43;
pub const lxb_tag_id_enum_t_LXB_TAG_DD: lxb_tag_id_enum_t = 44;
pub const lxb_tag_id_enum_t_LXB_TAG_DEL: lxb_tag_id_enum_t = 45;
pub const lxb_tag_id_enum_t_LXB_TAG_DESC: lxb_tag_id_enum_t = 46;
pub const lxb_tag_id_enum_t_LXB_TAG_DETAILS: lxb_tag_id_enum_t = 47;
pub const lxb_tag_id_enum_t_LXB_TAG_DFN: lxb_tag_id_enum_t = 48;
pub const lxb_tag_id_enum_t_LXB_TAG_DIALOG: lxb_tag_id_enum_t = 49;
pub const lxb_tag_id_enum_t_LXB_TAG_DIR: lxb_tag_id_enum_t = 50;
pub const lxb_tag_id_enum_t_LXB_TAG_DIV: lxb_tag_id_enum_t = 51;
pub const lxb_tag_id_enum_t_LXB_TAG_DL: lxb_tag_id_enum_t = 52;
pub const lxb_tag_id_enum_t_LXB_TAG_DT: lxb_tag_id_enum_t = 53;
pub const lxb_tag_id_enum_t_LXB_TAG_EM: lxb_tag_id_enum_t = 54;
pub const lxb_tag_id_enum_t_LXB_TAG_EMBED: lxb_tag_id_enum_t = 55;
pub const lxb_tag_id_enum_t_LXB_TAG_FEBLEND: lxb_tag_id_enum_t = 56;
pub const lxb_tag_id_enum_t_LXB_TAG_FECOLORMATRIX: lxb_tag_id_enum_t = 57;
pub const lxb_tag_id_enum_t_LXB_TAG_FECOMPONENTTRANSFER: lxb_tag_id_enum_t = 58;
pub const lxb_tag_id_enum_t_LXB_TAG_FECOMPOSITE: lxb_tag_id_enum_t = 59;
pub const lxb_tag_id_enum_t_LXB_TAG_FECONVOLVEMATRIX: lxb_tag_id_enum_t = 60;
pub const lxb_tag_id_enum_t_LXB_TAG_FEDIFFUSELIGHTING: lxb_tag_id_enum_t = 61;
pub const lxb_tag_id_enum_t_LXB_TAG_FEDISPLACEMENTMAP: lxb_tag_id_enum_t = 62;
pub const lxb_tag_id_enum_t_LXB_TAG_FEDISTANTLIGHT: lxb_tag_id_enum_t = 63;
pub const lxb_tag_id_enum_t_LXB_TAG_FEDROPSHADOW: lxb_tag_id_enum_t = 64;
pub const lxb_tag_id_enum_t_LXB_TAG_FEFLOOD: lxb_tag_id_enum_t = 65;
pub const lxb_tag_id_enum_t_LXB_TAG_FEFUNCA: lxb_tag_id_enum_t = 66;
pub const lxb_tag_id_enum_t_LXB_TAG_FEFUNCB: lxb_tag_id_enum_t = 67;
pub const lxb_tag_id_enum_t_LXB_TAG_FEFUNCG: lxb_tag_id_enum_t = 68;
pub const lxb_tag_id_enum_t_LXB_TAG_FEFUNCR: lxb_tag_id_enum_t = 69;
pub const lxb_tag_id_enum_t_LXB_TAG_FEGAUSSIANBLUR: lxb_tag_id_enum_t = 70;
pub const lxb_tag_id_enum_t_LXB_TAG_FEIMAGE: lxb_tag_id_enum_t = 71;
pub const lxb_tag_id_enum_t_LXB_TAG_FEMERGE: lxb_tag_id_enum_t = 72;
pub const lxb_tag_id_enum_t_LXB_TAG_FEMERGENODE: lxb_tag_id_enum_t = 73;
pub const lxb_tag_id_enum_t_LXB_TAG_FEMORPHOLOGY: lxb_tag_id_enum_t = 74;
pub const lxb_tag_id_enum_t_LXB_TAG_FEOFFSET: lxb_tag_id_enum_t = 75;
pub const lxb_tag_id_enum_t_LXB_TAG_FEPOINTLIGHT: lxb_tag_id_enum_t = 76;
pub const lxb_tag_id_enum_t_LXB_TAG_FESPECULARLIGHTING: lxb_tag_id_enum_t = 77;
pub const lxb_tag_id_enum_t_LXB_TAG_FESPOTLIGHT: lxb_tag_id_enum_t = 78;
pub const lxb_tag_id_enum_t_LXB_TAG_FETILE: lxb_tag_id_enum_t = 79;
pub const lxb_tag_id_enum_t_LXB_TAG_FETURBULENCE: lxb_tag_id_enum_t = 80;
pub const lxb_tag_id_enum_t_LXB_TAG_FIELDSET: lxb_tag_id_enum_t = 81;
pub const lxb_tag_id_enum_t_LXB_TAG_FIGCAPTION: lxb_tag_id_enum_t = 82;
pub const lxb_tag_id_enum_t_LXB_TAG_FIGURE: lxb_tag_id_enum_t = 83;
pub const lxb_tag_id_enum_t_LXB_TAG_FONT: lxb_tag_id_enum_t = 84;
pub const lxb_tag_id_enum_t_LXB_TAG_FOOTER: lxb_tag_id_enum_t = 85;
pub const lxb_tag_id_enum_t_LXB_TAG_FOREIGNOBJECT: lxb_tag_id_enum_t = 86;
pub const lxb_tag_id_enum_t_LXB_TAG_FORM: lxb_tag_id_enum_t = 87;
pub const lxb_tag_id_enum_t_LXB_TAG_FRAME: lxb_tag_id_enum_t = 88;
pub const lxb_tag_id_enum_t_LXB_TAG_FRAMESET: lxb_tag_id_enum_t = 89;
pub const lxb_tag_id_enum_t_LXB_TAG_GLYPHREF: lxb_tag_id_enum_t = 90;
pub const lxb_tag_id_enum_t_LXB_TAG_H1: lxb_tag_id_enum_t = 91;
pub const lxb_tag_id_enum_t_LXB_TAG_H2: lxb_tag_id_enum_t = 92;
pub const lxb_tag_id_enum_t_LXB_TAG_H3: lxb_tag_id_enum_t = 93;
pub const lxb_tag_id_enum_t_LXB_TAG_H4: lxb_tag_id_enum_t = 94;
pub const lxb_tag_id_enum_t_LXB_TAG_H5: lxb_tag_id_enum_t = 95;
pub const lxb_tag_id_enum_t_LXB_TAG_H6: lxb_tag_id_enum_t = 96;
pub const lxb_tag_id_enum_t_LXB_TAG_HEAD: lxb_tag_id_enum_t = 97;
pub const lxb_tag_id_enum_t_LXB_TAG_HEADER: lxb_tag_id_enum_t = 98;
pub const lxb_tag_id_enum_t_LXB_TAG_HGROUP: lxb_tag_id_enum_t = 99;
pub const lxb_tag_id_enum_t_LXB_TAG_HR: lxb_tag_id_enum_t = 100;
pub const lxb_tag_id_enum_t_LXB_TAG_HTML: lxb_tag_id_enum_t = 101;
pub const lxb_tag_id_enum_t_LXB_TAG_I: lxb_tag_id_enum_t = 102;
pub const lxb_tag_id_enum_t_LXB_TAG_IFRAME: lxb_tag_id_enum_t = 103;
pub const lxb_tag_id_enum_t_LXB_TAG_IMAGE: lxb_tag_id_enum_t = 104;
pub const lxb_tag_id_enum_t_LXB_TAG_IMG: lxb_tag_id_enum_t = 105;
pub const lxb_tag_id_enum_t_LXB_TAG_INPUT: lxb_tag_id_enum_t = 106;
pub const lxb_tag_id_enum_t_LXB_TAG_INS: lxb_tag_id_enum_t = 107;
pub const lxb_tag_id_enum_t_LXB_TAG_ISINDEX: lxb_tag_id_enum_t = 108;
pub const lxb_tag_id_enum_t_LXB_TAG_KBD: lxb_tag_id_enum_t = 109;
pub const lxb_tag_id_enum_t_LXB_TAG_KEYGEN: lxb_tag_id_enum_t = 110;
pub const lxb_tag_id_enum_t_LXB_TAG_LABEL: lxb_tag_id_enum_t = 111;
pub const lxb_tag_id_enum_t_LXB_TAG_LEGEND: lxb_tag_id_enum_t = 112;
pub const lxb_tag_id_enum_t_LXB_TAG_LI: lxb_tag_id_enum_t = 113;
pub const lxb_tag_id_enum_t_LXB_TAG_LINEARGRADIENT: lxb_tag_id_enum_t = 114;
pub const lxb_tag_id_enum_t_LXB_TAG_LINK: lxb_tag_id_enum_t = 115;
pub const lxb_tag_id_enum_t_LXB_TAG_LISTING: lxb_tag_id_enum_t = 116;
pub const lxb_tag_id_enum_t_LXB_TAG_MAIN: lxb_tag_id_enum_t = 117;
pub const lxb_tag_id_enum_t_LXB_TAG_MALIGNMARK: lxb_tag_id_enum_t = 118;
pub const lxb_tag_id_enum_t_LXB_TAG_MAP: lxb_tag_id_enum_t = 119;
pub const lxb_tag_id_enum_t_LXB_TAG_MARK: lxb_tag_id_enum_t = 120;
pub const lxb_tag_id_enum_t_LXB_TAG_MARQUEE: lxb_tag_id_enum_t = 121;
pub const lxb_tag_id_enum_t_LXB_TAG_MATH: lxb_tag_id_enum_t = 122;
pub const lxb_tag_id_enum_t_LXB_TAG_MENU: lxb_tag_id_enum_t = 123;
pub const lxb_tag_id_enum_t_LXB_TAG_META: lxb_tag_id_enum_t = 124;
pub const lxb_tag_id_enum_t_LXB_TAG_METER: lxb_tag_id_enum_t = 125;
pub const lxb_tag_id_enum_t_LXB_TAG_MFENCED: lxb_tag_id_enum_t = 126;
pub const lxb_tag_id_enum_t_LXB_TAG_MGLYPH: lxb_tag_id_enum_t = 127;
pub const lxb_tag_id_enum_t_LXB_TAG_MI: lxb_tag_id_enum_t = 128;
pub const lxb_tag_id_enum_t_LXB_TAG_MN: lxb_tag_id_enum_t = 129;
pub const lxb_tag_id_enum_t_LXB_TAG_MO: lxb_tag_id_enum_t = 130;
pub const lxb_tag_id_enum_t_LXB_TAG_MS: lxb_tag_id_enum_t = 131;
pub const lxb_tag_id_enum_t_LXB_TAG_MTEXT: lxb_tag_id_enum_t = 132;
pub const lxb_tag_id_enum_t_LXB_TAG_MULTICOL: lxb_tag_id_enum_t = 133;
pub const lxb_tag_id_enum_t_LXB_TAG_NAV: lxb_tag_id_enum_t = 134;
pub const lxb_tag_id_enum_t_LXB_TAG_NEXTID: lxb_tag_id_enum_t = 135;
pub const lxb_tag_id_enum_t_LXB_TAG_NOBR: lxb_tag_id_enum_t = 136;
pub const lxb_tag_id_enum_t_LXB_TAG_NOEMBED: lxb_tag_id_enum_t = 137;
pub const lxb_tag_id_enum_t_LXB_TAG_NOFRAMES: lxb_tag_id_enum_t = 138;
pub const lxb_tag_id_enum_t_LXB_TAG_NOSCRIPT: lxb_tag_id_enum_t = 139;
pub const lxb_tag_id_enum_t_LXB_TAG_OBJECT: lxb_tag_id_enum_t = 140;
pub const lxb_tag_id_enum_t_LXB_TAG_OL: lxb_tag_id_enum_t = 141;
pub const lxb_tag_id_enum_t_LXB_TAG_OPTGROUP: lxb_tag_id_enum_t = 142;
pub const lxb_tag_id_enum_t_LXB_TAG_OPTION: lxb_tag_id_enum_t = 143;
pub const lxb_tag_id_enum_t_LXB_TAG_OUTPUT: lxb_tag_id_enum_t = 144;
pub const lxb_tag_id_enum_t_LXB_TAG_P: lxb_tag_id_enum_t = 145;
pub const lxb_tag_id_enum_t_LXB_TAG_PARAM: lxb_tag_id_enum_t = 146;
pub const lxb_tag_id_enum_t_LXB_TAG_PATH: lxb_tag_id_enum_t = 147;
pub const lxb_tag_id_enum_t_LXB_TAG_PICTURE: lxb_tag_id_enum_t = 148;
pub const lxb_tag_id_enum_t_LXB_TAG_PLAINTEXT: lxb_tag_id_enum_t = 149;
pub const lxb_tag_id_enum_t_LXB_TAG_PRE: lxb_tag_id_enum_t = 150;
pub const lxb_tag_id_enum_t_LXB_TAG_PROGRESS: lxb_tag_id_enum_t = 151;
pub const lxb_tag_id_enum_t_LXB_TAG_Q: lxb_tag_id_enum_t = 152;
pub const lxb_tag_id_enum_t_LXB_TAG_RADIALGRADIENT: lxb_tag_id_enum_t = 153;
pub const lxb_tag_id_enum_t_LXB_TAG_RB: lxb_tag_id_enum_t = 154;
pub const lxb_tag_id_enum_t_LXB_TAG_RP: lxb_tag_id_enum_t = 155;
pub const lxb_tag_id_enum_t_LXB_TAG_RT: lxb_tag_id_enum_t = 156;
pub const lxb_tag_id_enum_t_LXB_TAG_RTC: lxb_tag_id_enum_t = 157;
pub const lxb_tag_id_enum_t_LXB_TAG_RUBY: lxb_tag_id_enum_t = 158;
pub const lxb_tag_id_enum_t_LXB_TAG_S: lxb_tag_id_enum_t = 159;
pub const lxb_tag_id_enum_t_LXB_TAG_SAMP: lxb_tag_id_enum_t = 160;
pub const lxb_tag_id_enum_t_LXB_TAG_SCRIPT: lxb_tag_id_enum_t = 161;
pub const lxb_tag_id_enum_t_LXB_TAG_SECTION: lxb_tag_id_enum_t = 162;
pub const lxb_tag_id_enum_t_LXB_TAG_SELECT: lxb_tag_id_enum_t = 163;
pub const lxb_tag_id_enum_t_LXB_TAG_SLOT: lxb_tag_id_enum_t = 164;
pub const lxb_tag_id_enum_t_LXB_TAG_SMALL: lxb_tag_id_enum_t = 165;
pub const lxb_tag_id_enum_t_LXB_TAG_SOURCE: lxb_tag_id_enum_t = 166;
pub const lxb_tag_id_enum_t_LXB_TAG_SPACER: lxb_tag_id_enum_t = 167;
pub const lxb_tag_id_enum_t_LXB_TAG_SPAN: lxb_tag_id_enum_t = 168;
pub const lxb_tag_id_enum_t_LXB_TAG_STRIKE: lxb_tag_id_enum_t = 169;
pub const lxb_tag_id_enum_t_LXB_TAG_STRONG: lxb_tag_id_enum_t = 170;
pub const lxb_tag_id_enum_t_LXB_TAG_STYLE: lxb_tag_id_enum_t = 171;
pub const lxb_tag_id_enum_t_LXB_TAG_SUB: lxb_tag_id_enum_t = 172;
pub const lxb_tag_id_enum_t_LXB_TAG_SUMMARY: lxb_tag_id_enum_t = 173;
pub const lxb_tag_id_enum_t_LXB_TAG_SUP: lxb_tag_id_enum_t = 174;
pub const lxb_tag_id_enum_t_LXB_TAG_SVG: lxb_tag_id_enum_t = 175;
pub const lxb_tag_id_enum_t_LXB_TAG_TABLE: lxb_tag_id_enum_t = 176;
pub const lxb_tag_id_enum_t_LXB_TAG_TBODY: lxb_tag_id_enum_t = 177;
pub const lxb_tag_id_enum_t_LXB_TAG_TD: lxb_tag_id_enum_t = 178;
pub const lxb_tag_id_enum_t_LXB_TAG_TEMPLATE: lxb_tag_id_enum_t = 179;
pub const lxb_tag_id_enum_t_LXB_TAG_TEXTAREA: lxb_tag_id_enum_t = 180;
pub const lxb_tag_id_enum_t_LXB_TAG_TEXTPATH: lxb_tag_id_enum_t = 181;
pub const lxb_tag_id_enum_t_LXB_TAG_TFOOT: lxb_tag_id_enum_t = 182;
pub const lxb_tag_id_enum_t_LXB_TAG_TH: lxb_tag_id_enum_t = 183;
pub const lxb_tag_id_enum_t_LXB_TAG_THEAD: lxb_tag_id_enum_t = 184;
pub const lxb_tag_id_enum_t_LXB_TAG_TIME: lxb_tag_id_enum_t = 185;
pub const lxb_tag_id_enum_t_LXB_TAG_TITLE: lxb_tag_id_enum_t = 186;
pub const lxb_tag_id_enum_t_LXB_TAG_TR: lxb_tag_id_enum_t = 187;
pub const lxb_tag_id_enum_t_LXB_TAG_TRACK: lxb_tag_id_enum_t = 188;
pub const lxb_tag_id_enum_t_LXB_TAG_TT: lxb_tag_id_enum_t = 189;
pub const lxb_tag_id_enum_t_LXB_TAG_U: lxb_tag_id_enum_t = 190;
pub const lxb_tag_id_enum_t_LXB_TAG_UL: lxb_tag_id_enum_t = 191;
pub const lxb_tag_id_enum_t_LXB_TAG_VAR: lxb_tag_id_enum_t = 192;
pub const lxb_tag_id_enum_t_LXB_TAG_VIDEO: lxb_tag_id_enum_t = 193;
pub const lxb_tag_id_enum_t_LXB_TAG_WBR: lxb_tag_id_enum_t = 194;
pub const lxb_tag_id_enum_t_LXB_TAG_XMP: lxb_tag_id_enum_t = 195;
pub const lxb_tag_id_enum_t_LXB_TAG__LAST_ENTRY: lxb_tag_id_enum_t = 196;
pub type lxb_tag_id_enum_t = cty::c_int;
pub type lxb_ns_id_t = usize;
pub type lxb_ns_prefix_id_t = usize;
pub const lxb_ns_id_enum_t_LXB_NS__UNDEF: lxb_ns_id_enum_t = 0;
pub const lxb_ns_id_enum_t_LXB_NS__ANY: lxb_ns_id_enum_t = 1;
pub const lxb_ns_id_enum_t_LXB_NS_HTML: lxb_ns_id_enum_t = 2;
pub const lxb_ns_id_enum_t_LXB_NS_MATH: lxb_ns_id_enum_t = 3;
pub const lxb_ns_id_enum_t_LXB_NS_SVG: lxb_ns_id_enum_t = 4;
pub const lxb_ns_id_enum_t_LXB_NS_XLINK: lxb_ns_id_enum_t = 5;
pub const lxb_ns_id_enum_t_LXB_NS_XML: lxb_ns_id_enum_t = 6;
pub const lxb_ns_id_enum_t_LXB_NS_XMLNS: lxb_ns_id_enum_t = 7;
pub const lxb_ns_id_enum_t_LXB_NS__LAST_ENTRY: lxb_ns_id_enum_t = 8;
pub type lxb_ns_id_enum_t = cty::c_int;
pub const lxb_dom_exception_code_t_LXB_DOM_INDEX_SIZE_ERR: lxb_dom_exception_code_t = 0;
pub const lxb_dom_exception_code_t_LXB_DOM_DOMSTRING_SIZE_ERR: lxb_dom_exception_code_t = 1;
pub const lxb_dom_exception_code_t_LXB_DOM_HIERARCHY_REQUEST_ERR: lxb_dom_exception_code_t = 2;
pub const lxb_dom_exception_code_t_LXB_DOM_WRONG_DOCUMENT_ERR: lxb_dom_exception_code_t = 3;
pub const lxb_dom_exception_code_t_LXB_DOM_INVALID_CHARACTER_ERR: lxb_dom_exception_code_t = 4;
pub const lxb_dom_exception_code_t_LXB_DOM_NO_DATA_ALLOWED_ERR: lxb_dom_exception_code_t = 5;
pub const lxb_dom_exception_code_t_LXB_DOM_NO_MODIFICATION_ALLOWED_ERR: lxb_dom_exception_code_t =
    6;
pub const lxb_dom_exception_code_t_LXB_DOM_NOT_FOUND_ERR: lxb_dom_exception_code_t = 7;
pub const lxb_dom_exception_code_t_LXB_DOM_NOT_SUPPORTED_ERR: lxb_dom_exception_code_t = 8;
pub const lxb_dom_exception_code_t_LXB_DOM_INUSE_ATTRIBUTE_ERR: lxb_dom_exception_code_t = 9;
pub const lxb_dom_exception_code_t_LXB_DOM_INVALID_STATE_ERR: lxb_dom_exception_code_t = 10;
pub const lxb_dom_exception_code_t_LXB_DOM_SYNTAX_ERR: lxb_dom_exception_code_t = 11;
pub const lxb_dom_exception_code_t_LXB_DOM_INVALID_MODIFICATION_ERR: lxb_dom_exception_code_t = 12;
pub const lxb_dom_exception_code_t_LXB_DOM_NAMESPACE_ERR: lxb_dom_exception_code_t = 13;
pub const lxb_dom_exception_code_t_LXB_DOM_INVALID_ACCESS_ERR: lxb_dom_exception_code_t = 14;
pub const lxb_dom_exception_code_t_LXB_DOM_VALIDATION_ERR: lxb_dom_exception_code_t = 15;
pub const lxb_dom_exception_code_t_LXB_DOM_TYPE_MISMATCH_ERR: lxb_dom_exception_code_t = 16;
pub const lxb_dom_exception_code_t_LXB_DOM_SECURITY_ERR: lxb_dom_exception_code_t = 17;
pub const lxb_dom_exception_code_t_LXB_DOM_NETWORK_ERR: lxb_dom_exception_code_t = 18;
pub const lxb_dom_exception_code_t_LXB_DOM_ABORT_ERR: lxb_dom_exception_code_t = 19;
pub const lxb_dom_exception_code_t_LXB_DOM_URL_MISMATCH_ERR: lxb_dom_exception_code_t = 20;
pub const lxb_dom_exception_code_t_LXB_DOM_QUOTA_EXCEEDED_ERR: lxb_dom_exception_code_t = 21;
pub const lxb_dom_exception_code_t_LXB_DOM_TIMEOUT_ERR: lxb_dom_exception_code_t = 22;
pub const lxb_dom_exception_code_t_LXB_DOM_INVALID_NODE_TYPE_ERR: lxb_dom_exception_code_t = 23;
pub const lxb_dom_exception_code_t_LXB_DOM_DATA_CLONE_ERR: lxb_dom_exception_code_t = 24;
pub type lxb_dom_exception_code_t = cty::c_int;
extern "C" {
    pub fn lxb_dom_exception_code_ref_set_noi(
        var: *mut lxb_dom_exception_code_t,
        code: lxb_dom_exception_code_t,
    ) -> *mut cty::c_void;
}
pub type lxb_dom_event_target_t = lxb_dom_event_target;
pub type lxb_dom_node_t = lxb_dom_node;
pub type lxb_dom_element_t = lxb_dom_element;
pub type lxb_dom_attr_t = lxb_dom_attr;
pub type lxb_dom_document_t = lxb_dom_document;
pub type lxb_dom_document_type_t = lxb_dom_document_type;
pub type lxb_dom_document_fragment_t = lxb_dom_document_fragment;
pub type lxb_dom_shadow_root_t = lxb_dom_shadow_root;
pub type lxb_dom_character_data_t = lxb_dom_character_data;
pub type lxb_dom_text_t = lxb_dom_text;
pub type lxb_dom_cdata_section_t = lxb_dom_cdata_section;
pub type lxb_dom_processing_instruction_t = lxb_dom_processing_instruction;
pub type lxb_dom_comment_t = lxb_dom_comment;
pub type lxb_dom_interface_t = cty::c_void;
pub type lxb_dom_interface_constructor_f =
    ::core::option::Option<unsafe extern "C" fn(document: *mut cty::c_void) -> *mut cty::c_void>;
pub type lxb_dom_interface_destructor_f =
    ::core::option::Option<unsafe extern "C" fn(intrfc: *mut cty::c_void) -> *mut cty::c_void>;
pub type lxb_dom_interface_create_f = ::core::option::Option<
    unsafe extern "C" fn(
        document: *mut lxb_dom_document_t,
        tag_id: lxb_tag_id_t,
        ns: lxb_ns_id_t,
    ) -> *mut lxb_dom_interface_t,
>;
pub type lxb_dom_interface_clone_f = ::core::option::Option<
    unsafe extern "C" fn(
        document: *mut lxb_dom_document_t,
        intrfc: *const lxb_dom_interface_t,
    ) -> *mut lxb_dom_interface_t,
>;
pub type lxb_dom_interface_destroy_f = ::core::option::Option<
    unsafe extern "C" fn(intrfc: *mut lxb_dom_interface_t) -> *mut lxb_dom_interface_t,
>;
pub type lxb_dom_event_insert_f =
    ::core::option::Option<unsafe extern "C" fn(node: *mut lxb_dom_node_t) -> lxb_status_t>;
pub type lxb_dom_event_remove_f =
    ::core::option::Option<unsafe extern "C" fn(node: *mut lxb_dom_node_t) -> lxb_status_t>;
pub type lxb_dom_event_destroy_f =
    ::core::option::Option<unsafe extern "C" fn(node: *mut lxb_dom_node_t) -> lxb_status_t>;
pub type lxb_dom_event_set_value_f = ::core::option::Option<
    unsafe extern "C" fn(
        node: *mut lxb_dom_node_t,
        value: *const lxb_char_t,
        length: usize,
    ) -> lxb_status_t,
>;
extern "C" {
    pub fn lxb_dom_interface_create(
        document: *mut lxb_dom_document_t,
        tag_id: lxb_tag_id_t,
        ns: lxb_ns_id_t,
    ) -> *mut lxb_dom_interface_t;
}
extern "C" {
    pub fn lxb_dom_interface_clone(
        document: *mut lxb_dom_document_t,
        intrfc: *const lxb_dom_interface_t,
    ) -> *mut lxb_dom_interface_t;
}
extern "C" {
    pub fn lxb_dom_interface_destroy(intrfc: *mut lxb_dom_interface_t) -> *mut lxb_dom_interface_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_array_t {
    pub list: *mut *mut cty::c_void,
    pub size: usize,
    pub length: usize,
}
#[test]
fn bindgen_test_layout_lexbor_array_t() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_array_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_array_t>(),
        24usize,
        concat!("Size of: ", stringify!(lexbor_array_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_array_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_array_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).list) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_array_t),
            "::",
            stringify!(list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_array_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_array_t),
            "::",
            stringify!(length)
        )
    );
}
impl Default for lexbor_array_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lexbor_array_create() -> *mut lexbor_array_t;
}
extern "C" {
    pub fn lexbor_array_init(array: *mut lexbor_array_t, size: usize) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_array_clean(array: *mut lexbor_array_t);
}
extern "C" {
    pub fn lexbor_array_destroy(
        array: *mut lexbor_array_t,
        self_destroy: bool,
    ) -> *mut lexbor_array_t;
}
extern "C" {
    pub fn lexbor_array_expand(array: *mut lexbor_array_t, up_to: usize) -> *mut *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_array_push(array: *mut lexbor_array_t, value: *mut cty::c_void) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_array_pop(array: *mut lexbor_array_t) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_array_insert(
        array: *mut lexbor_array_t,
        idx: usize,
        value: *mut cty::c_void,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_array_set(
        array: *mut lexbor_array_t,
        idx: usize,
        value: *mut cty::c_void,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_array_delete(array: *mut lexbor_array_t, begin: usize, length: usize);
}
extern "C" {
    pub fn lexbor_array_get_noi(array: *mut lexbor_array_t, idx: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_array_length_noi(array: *mut lexbor_array_t) -> usize;
}
extern "C" {
    pub fn lexbor_array_size_noi(array: *mut lexbor_array_t) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_collection_t {
    pub array: lexbor_array_t,
    pub document: *mut lxb_dom_document_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_collection_t() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_collection_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_collection_t>(),
        32usize,
        concat!("Size of: ", stringify!(lxb_dom_collection_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_collection_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_collection_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).array) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_collection_t),
            "::",
            stringify!(array)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).document) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_collection_t),
            "::",
            stringify!(document)
        )
    );
}
impl Default for lxb_dom_collection_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_collection_create(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_collection_t;
}
extern "C" {
    pub fn lxb_dom_collection_init(
        col: *mut lxb_dom_collection_t,
        start_list_size: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_collection_destroy(
        col: *mut lxb_dom_collection_t,
        self_destroy: bool,
    ) -> *mut lxb_dom_collection_t;
}
extern "C" {
    pub fn lxb_dom_collection_make_noi(
        document: *mut lxb_dom_document_t,
        start_list_size: usize,
    ) -> *mut lxb_dom_collection_t;
}
extern "C" {
    pub fn lxb_dom_collection_clean_noi(col: *mut lxb_dom_collection_t);
}
extern "C" {
    pub fn lxb_dom_collection_append_noi(
        col: *mut lxb_dom_collection_t,
        value: *mut cty::c_void,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_collection_element_noi(
        col: *mut lxb_dom_collection_t,
        idx: usize,
    ) -> *mut lxb_dom_element_t;
}
extern "C" {
    pub fn lxb_dom_collection_node_noi(
        col: *mut lxb_dom_collection_t,
        idx: usize,
    ) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_collection_length_noi(col: *mut lxb_dom_collection_t) -> usize;
}
pub type lexbor_mem_chunk_t = lexbor_mem_chunk;
pub type lexbor_mem_t = lexbor_mem;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_mem_chunk {
    pub data: *mut u8,
    pub length: usize,
    pub size: usize,
    pub next: *mut lexbor_mem_chunk_t,
    pub prev: *mut lexbor_mem_chunk_t,
}
#[test]
fn bindgen_test_layout_lexbor_mem_chunk() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_mem_chunk> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_mem_chunk>(),
        40usize,
        concat!("Size of: ", stringify!(lexbor_mem_chunk))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_mem_chunk>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_mem_chunk))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mem_chunk),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mem_chunk),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mem_chunk),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mem_chunk),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mem_chunk),
            "::",
            stringify!(prev)
        )
    );
}
impl Default for lexbor_mem_chunk {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_mem {
    pub chunk: *mut lexbor_mem_chunk_t,
    pub chunk_first: *mut lexbor_mem_chunk_t,
    pub chunk_min_size: usize,
    pub chunk_length: usize,
}
#[test]
fn bindgen_test_layout_lexbor_mem() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_mem> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_mem>(),
        32usize,
        concat!("Size of: ", stringify!(lexbor_mem))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_mem>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_mem))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chunk) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mem),
            "::",
            stringify!(chunk)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chunk_first) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mem),
            "::",
            stringify!(chunk_first)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chunk_min_size) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mem),
            "::",
            stringify!(chunk_min_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).chunk_length) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mem),
            "::",
            stringify!(chunk_length)
        )
    );
}
impl Default for lexbor_mem {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lexbor_mem_create() -> *mut lexbor_mem_t;
}
extern "C" {
    pub fn lexbor_mem_init(mem: *mut lexbor_mem_t, min_chunk_size: usize) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_mem_clean(mem: *mut lexbor_mem_t);
}
extern "C" {
    pub fn lexbor_mem_destroy(mem: *mut lexbor_mem_t, destroy_self: bool) -> *mut lexbor_mem_t;
}
extern "C" {
    pub fn lexbor_mem_chunk_init(
        mem: *mut lexbor_mem_t,
        chunk: *mut lexbor_mem_chunk_t,
        length: usize,
    ) -> *mut u8;
}
extern "C" {
    pub fn lexbor_mem_chunk_make(mem: *mut lexbor_mem_t, length: usize) -> *mut lexbor_mem_chunk_t;
}
extern "C" {
    pub fn lexbor_mem_chunk_destroy(
        mem: *mut lexbor_mem_t,
        chunk: *mut lexbor_mem_chunk_t,
        self_destroy: bool,
    ) -> *mut lexbor_mem_chunk_t;
}
extern "C" {
    pub fn lexbor_mem_alloc(mem: *mut lexbor_mem_t, length: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_mem_calloc(mem: *mut lexbor_mem_t, length: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_mem_current_length_noi(mem: *mut lexbor_mem_t) -> usize;
}
extern "C" {
    pub fn lexbor_mem_current_size_noi(mem: *mut lexbor_mem_t) -> usize;
}
extern "C" {
    pub fn lexbor_mem_chunk_length_noi(mem: *mut lexbor_mem_t) -> usize;
}
extern "C" {
    pub fn lexbor_mem_align_noi(size: usize) -> usize;
}
extern "C" {
    pub fn lexbor_mem_align_floor_noi(size: usize) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_dobject_t {
    pub mem: *mut lexbor_mem_t,
    pub cache: *mut lexbor_array_t,
    pub allocated: usize,
    pub struct_size: usize,
}
#[test]
fn bindgen_test_layout_lexbor_dobject_t() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_dobject_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_dobject_t>(),
        32usize,
        concat!("Size of: ", stringify!(lexbor_dobject_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_dobject_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_dobject_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mem) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_dobject_t),
            "::",
            stringify!(mem)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cache) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_dobject_t),
            "::",
            stringify!(cache)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).allocated) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_dobject_t),
            "::",
            stringify!(allocated)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).struct_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_dobject_t),
            "::",
            stringify!(struct_size)
        )
    );
}
impl Default for lexbor_dobject_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lexbor_dobject_create() -> *mut lexbor_dobject_t;
}
extern "C" {
    pub fn lexbor_dobject_init(
        dobject: *mut lexbor_dobject_t,
        chunk_size: usize,
        struct_size: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_dobject_clean(dobject: *mut lexbor_dobject_t);
}
extern "C" {
    pub fn lexbor_dobject_destroy(
        dobject: *mut lexbor_dobject_t,
        destroy_self: bool,
    ) -> *mut lexbor_dobject_t;
}
extern "C" {
    pub fn lexbor_dobject_init_list_entries(dobject: *mut lexbor_dobject_t, pos: usize) -> *mut u8;
}
extern "C" {
    pub fn lexbor_dobject_alloc(dobject: *mut lexbor_dobject_t) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_dobject_calloc(dobject: *mut lexbor_dobject_t) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_dobject_free(
        dobject: *mut lexbor_dobject_t,
        data: *mut cty::c_void,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_dobject_by_absolute_position(
        dobject: *mut lexbor_dobject_t,
        pos: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_dobject_allocated_noi(dobject: *mut lexbor_dobject_t) -> usize;
}
extern "C" {
    pub fn lexbor_dobject_cache_length_noi(dobject: *mut lexbor_dobject_t) -> usize;
}
pub type lexbor_bst_entry_t = lexbor_bst_entry;
pub type lexbor_bst_t = lexbor_bst;
pub type lexbor_bst_entry_f = ::core::option::Option<
    unsafe extern "C" fn(
        bst: *mut lexbor_bst_t,
        entry: *mut lexbor_bst_entry_t,
        ctx: *mut cty::c_void,
    ) -> bool,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_bst_entry {
    pub value: *mut cty::c_void,
    pub right: *mut lexbor_bst_entry_t,
    pub left: *mut lexbor_bst_entry_t,
    pub next: *mut lexbor_bst_entry_t,
    pub parent: *mut lexbor_bst_entry_t,
    pub size: usize,
}
#[test]
fn bindgen_test_layout_lexbor_bst_entry() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_bst_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_bst_entry>(),
        48usize,
        concat!("Size of: ", stringify!(lexbor_bst_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_bst_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_bst_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_bst_entry),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).right) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_bst_entry),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_bst_entry),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_bst_entry),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_bst_entry),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_bst_entry),
            "::",
            stringify!(size)
        )
    );
}
impl Default for lexbor_bst_entry {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_bst {
    pub dobject: *mut lexbor_dobject_t,
    pub root: *mut lexbor_bst_entry_t,
    pub tree_length: usize,
}
#[test]
fn bindgen_test_layout_lexbor_bst() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_bst> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_bst>(),
        24usize,
        concat!("Size of: ", stringify!(lexbor_bst))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_bst>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_bst))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dobject) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_bst),
            "::",
            stringify!(dobject)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).root) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_bst),
            "::",
            stringify!(root)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tree_length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_bst),
            "::",
            stringify!(tree_length)
        )
    );
}
impl Default for lexbor_bst {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lexbor_bst_create() -> *mut lexbor_bst_t;
}
extern "C" {
    pub fn lexbor_bst_init(bst: *mut lexbor_bst_t, size: usize) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_bst_clean(bst: *mut lexbor_bst_t);
}
extern "C" {
    pub fn lexbor_bst_destroy(bst: *mut lexbor_bst_t, self_destroy: bool) -> *mut lexbor_bst_t;
}
extern "C" {
    pub fn lexbor_bst_entry_make(bst: *mut lexbor_bst_t, size: usize) -> *mut lexbor_bst_entry_t;
}
extern "C" {
    pub fn lexbor_bst_insert(
        bst: *mut lexbor_bst_t,
        scope: *mut *mut lexbor_bst_entry_t,
        size: usize,
        value: *mut cty::c_void,
    ) -> *mut lexbor_bst_entry_t;
}
extern "C" {
    pub fn lexbor_bst_insert_not_exists(
        bst: *mut lexbor_bst_t,
        scope: *mut *mut lexbor_bst_entry_t,
        size: usize,
    ) -> *mut lexbor_bst_entry_t;
}
extern "C" {
    pub fn lexbor_bst_search(
        bst: *mut lexbor_bst_t,
        scope: *mut lexbor_bst_entry_t,
        size: usize,
    ) -> *mut lexbor_bst_entry_t;
}
extern "C" {
    pub fn lexbor_bst_search_close(
        bst: *mut lexbor_bst_t,
        scope: *mut lexbor_bst_entry_t,
        size: usize,
    ) -> *mut lexbor_bst_entry_t;
}
extern "C" {
    pub fn lexbor_bst_remove(
        bst: *mut lexbor_bst_t,
        root: *mut *mut lexbor_bst_entry_t,
        size: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_bst_remove_close(
        bst: *mut lexbor_bst_t,
        root: *mut *mut lexbor_bst_entry_t,
        size: usize,
        found_size: *mut usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_bst_remove_by_pointer(
        bst: *mut lexbor_bst_t,
        entry: *mut lexbor_bst_entry_t,
        root: *mut *mut lexbor_bst_entry_t,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_bst_serialize(
        bst: *mut lexbor_bst_t,
        callback: lexbor_callback_f,
        ctx: *mut cty::c_void,
    );
}
extern "C" {
    pub fn lexbor_bst_serialize_entry(
        entry: *mut lexbor_bst_entry_t,
        callback: lexbor_callback_f,
        ctx: *mut cty::c_void,
        tabs: usize,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_mraw_t {
    pub mem: *mut lexbor_mem_t,
    pub cache: *mut lexbor_bst_t,
    pub ref_count: usize,
}
#[test]
fn bindgen_test_layout_lexbor_mraw_t() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_mraw_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_mraw_t>(),
        24usize,
        concat!("Size of: ", stringify!(lexbor_mraw_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_mraw_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_mraw_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mem) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mraw_t),
            "::",
            stringify!(mem)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cache) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mraw_t),
            "::",
            stringify!(cache)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ref_count) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_mraw_t),
            "::",
            stringify!(ref_count)
        )
    );
}
impl Default for lexbor_mraw_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lexbor_mraw_create() -> *mut lexbor_mraw_t;
}
extern "C" {
    pub fn lexbor_mraw_init(mraw: *mut lexbor_mraw_t, chunk_size: usize) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_mraw_clean(mraw: *mut lexbor_mraw_t);
}
extern "C" {
    pub fn lexbor_mraw_destroy(mraw: *mut lexbor_mraw_t, destroy_self: bool) -> *mut lexbor_mraw_t;
}
extern "C" {
    pub fn lexbor_mraw_alloc(mraw: *mut lexbor_mraw_t, size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_mraw_calloc(mraw: *mut lexbor_mraw_t, size: usize) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_mraw_realloc(
        mraw: *mut lexbor_mraw_t,
        data: *mut cty::c_void,
        new_size: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_mraw_free(mraw: *mut lexbor_mraw_t, data: *mut cty::c_void) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_mraw_data_size_noi(data: *mut cty::c_void) -> usize;
}
extern "C" {
    pub fn lexbor_mraw_data_size_set_noi(data: *mut cty::c_void, size: usize);
}
extern "C" {
    pub fn lexbor_mraw_dup_noi(
        mraw: *mut lexbor_mraw_t,
        src: *const cty::c_void,
        size: usize,
    ) -> *mut cty::c_void;
}
pub type lexbor_hash_search_t = lexbor_hash_search;
pub type lexbor_hash_insert_t = lexbor_hash_insert;
extern "C" {
    pub static mut lexbor_hash_insert_raw: *const lexbor_hash_insert_t;
}
extern "C" {
    pub static mut lexbor_hash_insert_lower: *const lexbor_hash_insert_t;
}
extern "C" {
    pub static mut lexbor_hash_insert_upper: *const lexbor_hash_insert_t;
}
extern "C" {
    pub static mut lexbor_hash_search_raw: *const lexbor_hash_search_t;
}
extern "C" {
    pub static mut lexbor_hash_search_lower: *const lexbor_hash_search_t;
}
extern "C" {
    pub static mut lexbor_hash_search_upper: *const lexbor_hash_search_t;
}
pub type lexbor_hash_t = lexbor_hash;
pub type lexbor_hash_entry_t = lexbor_hash_entry;
pub type lexbor_hash_id_f =
    ::core::option::Option<unsafe extern "C" fn(key: *const lxb_char_t, size: usize) -> u32>;
pub type lexbor_hash_copy_f = ::core::option::Option<
    unsafe extern "C" fn(
        hash: *mut lexbor_hash_t,
        entry: *mut lexbor_hash_entry_t,
        key: *const lxb_char_t,
        size: usize,
    ) -> lxb_status_t,
>;
pub type lexbor_hash_cmp_f = ::core::option::Option<
    unsafe extern "C" fn(first: *const lxb_char_t, second: *const lxb_char_t, size: usize) -> bool,
>;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lexbor_hash_entry {
    pub u: lexbor_hash_entry__bindgen_ty_1,
    pub length: usize,
    pub next: *mut lexbor_hash_entry_t,
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union lexbor_hash_entry__bindgen_ty_1 {
    pub long_str: *mut lxb_char_t,
    pub short_str: [lxb_char_t; 17usize],
}
#[test]
fn bindgen_test_layout_lexbor_hash_entry__bindgen_ty_1() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_hash_entry__bindgen_ty_1> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_hash_entry__bindgen_ty_1>(),
        24usize,
        concat!("Size of: ", stringify!(lexbor_hash_entry__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_hash_entry__bindgen_ty_1>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_hash_entry__bindgen_ty_1))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).long_str) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash_entry__bindgen_ty_1),
            "::",
            stringify!(long_str)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).short_str) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash_entry__bindgen_ty_1),
            "::",
            stringify!(short_str)
        )
    );
}
impl Default for lexbor_hash_entry__bindgen_ty_1 {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[test]
fn bindgen_test_layout_lexbor_hash_entry() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_hash_entry> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_hash_entry>(),
        40usize,
        concat!("Size of: ", stringify!(lexbor_hash_entry))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_hash_entry>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_hash_entry))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).u) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash_entry),
            "::",
            stringify!(u)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash_entry),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash_entry),
            "::",
            stringify!(next)
        )
    );
}
impl Default for lexbor_hash_entry {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_hash {
    pub entries: *mut lexbor_dobject_t,
    pub mraw: *mut lexbor_mraw_t,
    pub table: *mut *mut lexbor_hash_entry_t,
    pub table_size: usize,
    pub struct_size: usize,
}
#[test]
fn bindgen_test_layout_lexbor_hash() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_hash> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_hash>(),
        40usize,
        concat!("Size of: ", stringify!(lexbor_hash))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_hash>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_hash))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entries) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash),
            "::",
            stringify!(entries)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mraw) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash),
            "::",
            stringify!(mraw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash),
            "::",
            stringify!(table)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).table_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash),
            "::",
            stringify!(table_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).struct_size) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash),
            "::",
            stringify!(struct_size)
        )
    );
}
impl Default for lexbor_hash {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct lexbor_hash_insert {
    pub hash: lexbor_hash_id_f,
    pub cmp: lexbor_hash_cmp_f,
    pub copy: lexbor_hash_copy_f,
}
#[test]
fn bindgen_test_layout_lexbor_hash_insert() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_hash_insert> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_hash_insert>(),
        24usize,
        concat!("Size of: ", stringify!(lexbor_hash_insert))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_hash_insert>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_hash_insert))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash_insert),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash_insert),
            "::",
            stringify!(cmp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).copy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash_insert),
            "::",
            stringify!(copy)
        )
    );
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone, PartialEq)]
pub struct lexbor_hash_search {
    pub hash: lexbor_hash_id_f,
    pub cmp: lexbor_hash_cmp_f,
}
#[test]
fn bindgen_test_layout_lexbor_hash_search() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_hash_search> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_hash_search>(),
        16usize,
        concat!("Size of: ", stringify!(lexbor_hash_search))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_hash_search>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_hash_search))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).hash) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash_search),
            "::",
            stringify!(hash)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).cmp) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_hash_search),
            "::",
            stringify!(cmp)
        )
    );
}
extern "C" {
    pub fn lexbor_hash_create() -> *mut lexbor_hash_t;
}
extern "C" {
    pub fn lexbor_hash_init(
        hash: *mut lexbor_hash_t,
        table_size: usize,
        struct_size: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_hash_clean(hash: *mut lexbor_hash_t);
}
extern "C" {
    pub fn lexbor_hash_destroy(hash: *mut lexbor_hash_t, destroy_obj: bool) -> *mut lexbor_hash_t;
}
extern "C" {
    pub fn lexbor_hash_insert(
        hash: *mut lexbor_hash_t,
        insert: *const lexbor_hash_insert_t,
        key: *const lxb_char_t,
        length: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_hash_insert_by_entry(
        hash: *mut lexbor_hash_t,
        entry: *mut lexbor_hash_entry_t,
        search: *const lexbor_hash_search_t,
        key: *const lxb_char_t,
        length: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_hash_remove(
        hash: *mut lexbor_hash_t,
        search: *const lexbor_hash_search_t,
        key: *const lxb_char_t,
        length: usize,
    );
}
extern "C" {
    pub fn lexbor_hash_search(
        hash: *mut lexbor_hash_t,
        search: *const lexbor_hash_search_t,
        key: *const lxb_char_t,
        length: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_hash_remove_by_hash_id(
        hash: *mut lexbor_hash_t,
        hash_id: u32,
        key: *const lxb_char_t,
        length: usize,
        cmp_func: lexbor_hash_cmp_f,
    );
}
extern "C" {
    pub fn lexbor_hash_search_by_hash_id(
        hash: *mut lexbor_hash_t,
        hash_id: u32,
        key: *const lxb_char_t,
        length: usize,
        cmp_func: lexbor_hash_cmp_f,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_hash_make_id(key: *const lxb_char_t, length: usize) -> u32;
}
extern "C" {
    pub fn lexbor_hash_make_id_lower(key: *const lxb_char_t, length: usize) -> u32;
}
extern "C" {
    pub fn lexbor_hash_make_id_upper(key: *const lxb_char_t, length: usize) -> u32;
}
extern "C" {
    pub fn lexbor_hash_copy(
        hash: *mut lexbor_hash_t,
        entry: *mut lexbor_hash_entry_t,
        key: *const lxb_char_t,
        length: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_hash_copy_lower(
        hash: *mut lexbor_hash_t,
        entry: *mut lexbor_hash_entry_t,
        key: *const lxb_char_t,
        length: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_hash_copy_upper(
        hash: *mut lexbor_hash_t,
        entry: *mut lexbor_hash_entry_t,
        key: *const lxb_char_t,
        length: usize,
    ) -> lxb_status_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_event_target {
    pub events: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout_lxb_dom_event_target() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_event_target> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_event_target>(),
        8usize,
        concat!("Size of: ", stringify!(lxb_dom_event_target))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_event_target>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_event_target))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).events) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_event_target),
            "::",
            stringify!(events)
        )
    );
}
impl Default for lxb_dom_event_target {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_event_target_create(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_event_target_t;
}
extern "C" {
    pub fn lxb_dom_event_target_destroy(
        event_target: *mut lxb_dom_event_target_t,
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_event_target_t;
}
pub type lxb_dom_node_simple_walker_f = ::core::option::Option<
    unsafe extern "C" fn(node: *mut lxb_dom_node_t, ctx: *mut cty::c_void) -> lexbor_action_t,
>;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_UNDEF: lxb_dom_node_type_t = 0;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_ELEMENT: lxb_dom_node_type_t = 1;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_ATTRIBUTE: lxb_dom_node_type_t = 2;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_TEXT: lxb_dom_node_type_t = 3;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_CDATA_SECTION: lxb_dom_node_type_t = 4;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_ENTITY_REFERENCE: lxb_dom_node_type_t = 5;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_ENTITY: lxb_dom_node_type_t = 6;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_PROCESSING_INSTRUCTION: lxb_dom_node_type_t = 7;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_COMMENT: lxb_dom_node_type_t = 8;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_DOCUMENT: lxb_dom_node_type_t = 9;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_DOCUMENT_TYPE: lxb_dom_node_type_t = 10;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_DOCUMENT_FRAGMENT: lxb_dom_node_type_t = 11;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_NOTATION: lxb_dom_node_type_t = 12;
pub const lxb_dom_node_type_t_LXB_DOM_NODE_TYPE_LAST_ENTRY: lxb_dom_node_type_t = 13;
pub type lxb_dom_node_type_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_node {
    pub event_target: lxb_dom_event_target_t,
    pub local_name: usize,
    pub prefix: usize,
    pub ns: usize,
    pub owner_document: *mut lxb_dom_document_t,
    pub next: *mut lxb_dom_node_t,
    pub prev: *mut lxb_dom_node_t,
    pub parent: *mut lxb_dom_node_t,
    pub first_child: *mut lxb_dom_node_t,
    pub last_child: *mut lxb_dom_node_t,
    pub user: *mut cty::c_void,
    pub type_: lxb_dom_node_type_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_node() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_node> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_node>(),
        96usize,
        concat!("Size of: ", stringify!(lxb_dom_node))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_node>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_node))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).event_target) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(event_target)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).local_name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(local_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prefix) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(prefix)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ns) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(ns)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).owner_document) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(owner_document)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(parent)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).first_child) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(first_child)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).last_child) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(last_child)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_node),
            "::",
            stringify!(type_)
        )
    );
}
impl Default for lxb_dom_node {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_node_interface_create(document: *mut lxb_dom_document_t) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_node_interface_clone(
        document: *mut lxb_dom_document_t,
        node: *const lxb_dom_node_t,
        is_attr: bool,
    ) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_node_interface_destroy(node: *mut lxb_dom_node_t) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_node_interface_copy(
        dst: *mut lxb_dom_node_t,
        src: *const lxb_dom_node_t,
        is_attr: bool,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_node_destroy(node: *mut lxb_dom_node_t) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_node_destroy_deep(root: *mut lxb_dom_node_t) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_node_clone(node: *mut lxb_dom_node_t, deep: bool) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_node_name(node: *mut lxb_dom_node_t, len: *mut usize) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_node_insert_child_wo_events(to: *mut lxb_dom_node_t, node: *mut lxb_dom_node_t);
}
extern "C" {
    pub fn lxb_dom_node_insert_child(to: *mut lxb_dom_node_t, node: *mut lxb_dom_node_t);
}
extern "C" {
    pub fn lxb_dom_node_insert_before_wo_events(to: *mut lxb_dom_node_t, node: *mut lxb_dom_node_t);
}
extern "C" {
    pub fn lxb_dom_node_insert_before(to: *mut lxb_dom_node_t, node: *mut lxb_dom_node_t);
}
extern "C" {
    pub fn lxb_dom_node_insert_after_wo_events(to: *mut lxb_dom_node_t, node: *mut lxb_dom_node_t);
}
extern "C" {
    pub fn lxb_dom_node_insert_after(to: *mut lxb_dom_node_t, node: *mut lxb_dom_node_t);
}
extern "C" {
    pub fn lxb_dom_node_remove_wo_events(node: *mut lxb_dom_node_t);
}
extern "C" {
    pub fn lxb_dom_node_remove(node: *mut lxb_dom_node_t);
}
extern "C" {
    pub fn lxb_dom_node_replace_all(
        parent: *mut lxb_dom_node_t,
        node: *mut lxb_dom_node_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_node_simple_walk(
        root: *mut lxb_dom_node_t,
        walker_cb: lxb_dom_node_simple_walker_f,
        ctx: *mut cty::c_void,
    );
}
extern "C" {
    pub fn lxb_dom_node_by_tag_name(
        root: *mut lxb_dom_node_t,
        collection: *mut lxb_dom_collection_t,
        qualified_name: *const lxb_char_t,
        len: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_node_by_class_name(
        root: *mut lxb_dom_node_t,
        collection: *mut lxb_dom_collection_t,
        class_name: *const lxb_char_t,
        len: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_node_by_attr(
        root: *mut lxb_dom_node_t,
        collection: *mut lxb_dom_collection_t,
        qualified_name: *const lxb_char_t,
        qname_len: usize,
        value: *const lxb_char_t,
        value_len: usize,
        case_insensitive: bool,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_node_by_attr_begin(
        root: *mut lxb_dom_node_t,
        collection: *mut lxb_dom_collection_t,
        qualified_name: *const lxb_char_t,
        qname_len: usize,
        value: *const lxb_char_t,
        value_len: usize,
        case_insensitive: bool,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_node_by_attr_end(
        root: *mut lxb_dom_node_t,
        collection: *mut lxb_dom_collection_t,
        qualified_name: *const lxb_char_t,
        qname_len: usize,
        value: *const lxb_char_t,
        value_len: usize,
        case_insensitive: bool,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_node_by_attr_contain(
        root: *mut lxb_dom_node_t,
        collection: *mut lxb_dom_collection_t,
        qualified_name: *const lxb_char_t,
        qname_len: usize,
        value: *const lxb_char_t,
        value_len: usize,
        case_insensitive: bool,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_node_text_content(node: *mut lxb_dom_node_t, len: *mut usize)
        -> *mut lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_node_text_content_set(
        node: *mut lxb_dom_node_t,
        content: *const lxb_char_t,
        len: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_node_is_empty(root: *mut lxb_dom_node_t) -> bool;
}
extern "C" {
    pub fn lxb_dom_node_tag_id_noi(node: *mut lxb_dom_node_t) -> lxb_tag_id_t;
}
extern "C" {
    pub fn lxb_dom_node_next_noi(node: *mut lxb_dom_node_t) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_node_prev_noi(node: *mut lxb_dom_node_t) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_node_parent_noi(node: *mut lxb_dom_node_t) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_node_first_child_noi(node: *mut lxb_dom_node_t) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_node_last_child_noi(node: *mut lxb_dom_node_t) -> *mut lxb_dom_node_t;
}
pub const lxb_dom_document_cmode_t_LXB_DOM_DOCUMENT_CMODE_NO_QUIRKS: lxb_dom_document_cmode_t = 0;
pub const lxb_dom_document_cmode_t_LXB_DOM_DOCUMENT_CMODE_QUIRKS: lxb_dom_document_cmode_t = 1;
pub const lxb_dom_document_cmode_t_LXB_DOM_DOCUMENT_CMODE_LIMITED_QUIRKS: lxb_dom_document_cmode_t =
    2;
pub type lxb_dom_document_cmode_t = cty::c_int;
pub const lxb_dom_document_dtype_t_LXB_DOM_DOCUMENT_DTYPE_UNDEF: lxb_dom_document_dtype_t = 0;
pub const lxb_dom_document_dtype_t_LXB_DOM_DOCUMENT_DTYPE_HTML: lxb_dom_document_dtype_t = 1;
pub const lxb_dom_document_dtype_t_LXB_DOM_DOCUMENT_DTYPE_XML: lxb_dom_document_dtype_t = 2;
pub type lxb_dom_document_dtype_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_document {
    pub node: lxb_dom_node_t,
    pub compat_mode: lxb_dom_document_cmode_t,
    pub type_: lxb_dom_document_dtype_t,
    pub doctype: *mut lxb_dom_document_type_t,
    pub element: *mut lxb_dom_element_t,
    pub create_interface: lxb_dom_interface_create_f,
    pub clone_interface: lxb_dom_interface_clone_f,
    pub destroy_interface: lxb_dom_interface_destroy_f,
    pub ev_insert: lxb_dom_event_insert_f,
    pub ev_remove: lxb_dom_event_remove_f,
    pub ev_destroy: lxb_dom_event_destroy_f,
    pub ev_set_value: lxb_dom_event_set_value_f,
    pub mraw: *mut lexbor_mraw_t,
    pub text: *mut lexbor_mraw_t,
    pub tags: *mut lexbor_hash_t,
    pub attrs: *mut lexbor_hash_t,
    pub prefix: *mut lexbor_hash_t,
    pub ns: *mut lexbor_hash_t,
    pub parser: *mut cty::c_void,
    pub user: *mut cty::c_void,
    pub tags_inherited: bool,
    pub ns_inherited: bool,
    pub scripting: bool,
}
#[test]
fn bindgen_test_layout_lxb_dom_document() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_document> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_document>(),
        248usize,
        concat!("Size of: ", stringify!(lxb_dom_document))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_document>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_document))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).compat_mode) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(compat_mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        100usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).doctype) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(doctype)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).element) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(element)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).create_interface) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(create_interface)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).clone_interface) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(clone_interface)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).destroy_interface) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(destroy_interface)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ev_insert) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(ev_insert)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ev_remove) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(ev_remove)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ev_destroy) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(ev_destroy)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ev_set_value) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(ev_set_value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mraw) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(mraw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).text) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(text)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tags) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(tags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).attrs) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(attrs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prefix) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(prefix)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ns) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(ns)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).parser) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(parser)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).user) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(user)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tags_inherited) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(tags_inherited)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ns_inherited) as usize - ptr as usize },
        241usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(ns_inherited)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).scripting) as usize - ptr as usize },
        242usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document),
            "::",
            stringify!(scripting)
        )
    );
}
impl Default for lxb_dom_document {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_document_interface_create(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_document_t;
}
extern "C" {
    pub fn lxb_dom_document_interface_clone(
        document: *mut lxb_dom_document_t,
        doc: *const lxb_dom_document_t,
    ) -> *mut lxb_dom_document_t;
}
extern "C" {
    pub fn lxb_dom_document_interface_destroy(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_document_t;
}
extern "C" {
    pub fn lxb_dom_document_create(owner: *mut lxb_dom_document_t) -> *mut lxb_dom_document_t;
}
extern "C" {
    pub fn lxb_dom_document_init(
        document: *mut lxb_dom_document_t,
        owner: *mut lxb_dom_document_t,
        create_interface: lxb_dom_interface_create_f,
        clone_interface: lxb_dom_interface_clone_f,
        destroy_interface: lxb_dom_interface_destroy_f,
        type_: lxb_dom_document_dtype_t,
        ns: cty::c_uint,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_document_clean(document: *mut lxb_dom_document_t) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_document_destroy(document: *mut lxb_dom_document_t) -> *mut lxb_dom_document_t;
}
extern "C" {
    pub fn lxb_dom_document_attach_doctype(
        document: *mut lxb_dom_document_t,
        doctype: *mut lxb_dom_document_type_t,
    );
}
extern "C" {
    pub fn lxb_dom_document_attach_element(
        document: *mut lxb_dom_document_t,
        element: *mut lxb_dom_element_t,
    );
}
extern "C" {
    pub fn lxb_dom_document_create_element(
        document: *mut lxb_dom_document_t,
        local_name: *const lxb_char_t,
        lname_len: usize,
        reserved_for_opt: *mut cty::c_void,
    ) -> *mut lxb_dom_element_t;
}
extern "C" {
    pub fn lxb_dom_document_destroy_element(
        element: *mut lxb_dom_element_t,
    ) -> *mut lxb_dom_element_t;
}
extern "C" {
    pub fn lxb_dom_document_create_document_fragment(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_document_fragment_t;
}
extern "C" {
    pub fn lxb_dom_document_create_text_node(
        document: *mut lxb_dom_document_t,
        data: *const lxb_char_t,
        len: usize,
    ) -> *mut lxb_dom_text_t;
}
extern "C" {
    pub fn lxb_dom_document_create_cdata_section(
        document: *mut lxb_dom_document_t,
        data: *const lxb_char_t,
        len: usize,
    ) -> *mut lxb_dom_cdata_section_t;
}
extern "C" {
    pub fn lxb_dom_document_create_processing_instruction(
        document: *mut lxb_dom_document_t,
        target: *const lxb_char_t,
        target_len: usize,
        data: *const lxb_char_t,
        data_len: usize,
    ) -> *mut lxb_dom_processing_instruction_t;
}
extern "C" {
    pub fn lxb_dom_document_create_comment(
        document: *mut lxb_dom_document_t,
        data: *const lxb_char_t,
        len: usize,
    ) -> *mut lxb_dom_comment_t;
}
extern "C" {
    pub fn lxb_dom_document_root(document: *mut lxb_dom_document_t) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_document_import_node(
        doc: *mut lxb_dom_document_t,
        node: *mut lxb_dom_node_t,
        deep: bool,
    ) -> *mut lxb_dom_node_t;
}
extern "C" {
    pub fn lxb_dom_document_create_interface_noi(
        document: *mut lxb_dom_document_t,
        tag_id: lxb_tag_id_t,
        ns: lxb_ns_id_t,
    ) -> *mut lxb_dom_interface_t;
}
extern "C" {
    pub fn lxb_dom_document_destroy_interface_noi(
        intrfc: *mut lxb_dom_interface_t,
    ) -> *mut lxb_dom_interface_t;
}
extern "C" {
    pub fn lxb_dom_document_create_struct_noi(
        document: *mut lxb_dom_document_t,
        struct_size: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lxb_dom_document_destroy_struct_noi(
        document: *mut lxb_dom_document_t,
        structure: *mut cty::c_void,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lxb_dom_document_create_text_noi(
        document: *mut lxb_dom_document_t,
        len: usize,
    ) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_document_destroy_text_noi(
        document: *mut lxb_dom_document_t,
        text: *mut lxb_char_t,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lxb_dom_document_element_noi(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_element_t;
}
extern "C" {
    pub fn lxb_dom_document_scripting_noi(document: *mut lxb_dom_document_t) -> bool;
}
extern "C" {
    pub fn lxb_dom_document_scripting_set_noi(document: *mut lxb_dom_document_t, scripting: bool);
}
extern "C" {
    pub fn lexbor_utils_power(t: usize, k: usize) -> usize;
}
extern "C" {
    pub fn lexbor_utils_hash_hash(key: *const lxb_char_t, key_size: usize) -> usize;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_str_t {
    pub data: *mut lxb_char_t,
    pub length: usize,
}
#[test]
fn bindgen_test_layout_lexbor_str_t() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_str_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_str_t>(),
        16usize,
        concat!("Size of: ", stringify!(lexbor_str_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_str_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_str_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_str_t),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_str_t),
            "::",
            stringify!(length)
        )
    );
}
impl Default for lexbor_str_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lexbor_str_create() -> *mut lexbor_str_t;
}
extern "C" {
    pub fn lexbor_str_init(
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
        size: usize,
    ) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_init_append(
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
        data: *const lxb_char_t,
        length: usize,
    ) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_clean(str_: *mut lexbor_str_t);
}
extern "C" {
    pub fn lexbor_str_clean_all(str_: *mut lexbor_str_t);
}
extern "C" {
    pub fn lexbor_str_destroy(
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
        destroy_obj: bool,
    ) -> *mut lexbor_str_t;
}
extern "C" {
    pub fn lexbor_str_realloc(
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
        new_size: usize,
    ) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_check_size(
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
        plus_len: usize,
    ) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_append(
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
        data: *const lxb_char_t,
        length: usize,
    ) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_append_before(
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
        buff: *const lxb_char_t,
        length: usize,
    ) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_append_one(
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
        data: lxb_char_t,
    ) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_append_lowercase(
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
        data: *const lxb_char_t,
        length: usize,
    ) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_append_with_rep_null_chars(
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
        buff: *const lxb_char_t,
        length: usize,
    ) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_copy(
        dest: *mut lexbor_str_t,
        target: *const lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
    ) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_stay_only_whitespace(target: *mut lexbor_str_t);
}
extern "C" {
    pub fn lexbor_str_strip_collapse_whitespace(target: *mut lexbor_str_t);
}
extern "C" {
    pub fn lexbor_str_crop_whitespace_from_begin(target: *mut lexbor_str_t) -> usize;
}
extern "C" {
    pub fn lexbor_str_whitespace_from_begin(target: *mut lexbor_str_t) -> usize;
}
extern "C" {
    pub fn lexbor_str_whitespace_from_end(target: *mut lexbor_str_t) -> usize;
}
extern "C" {
    pub fn lexbor_str_data_ncasecmp_first(
        first: *const lxb_char_t,
        sec: *const lxb_char_t,
        sec_size: usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_data_ncasecmp_end(
        first: *const lxb_char_t,
        sec: *const lxb_char_t,
        size: usize,
    ) -> bool;
}
extern "C" {
    pub fn lexbor_str_data_ncasecmp_contain(
        where_: *const lxb_char_t,
        where_size: usize,
        what: *const lxb_char_t,
        what_size: usize,
    ) -> bool;
}
extern "C" {
    pub fn lexbor_str_data_ncasecmp(
        first: *const lxb_char_t,
        sec: *const lxb_char_t,
        size: usize,
    ) -> bool;
}
extern "C" {
    pub fn lexbor_str_data_nlocmp_right(
        first: *const lxb_char_t,
        sec: *const lxb_char_t,
        size: usize,
    ) -> bool;
}
extern "C" {
    pub fn lexbor_str_data_nupcmp_right(
        first: *const lxb_char_t,
        sec: *const lxb_char_t,
        size: usize,
    ) -> bool;
}
extern "C" {
    pub fn lexbor_str_data_casecmp(first: *const lxb_char_t, sec: *const lxb_char_t) -> bool;
}
extern "C" {
    pub fn lexbor_str_data_ncmp_end(
        first: *const lxb_char_t,
        sec: *const lxb_char_t,
        size: usize,
    ) -> bool;
}
extern "C" {
    pub fn lexbor_str_data_ncmp_contain(
        where_: *const lxb_char_t,
        where_size: usize,
        what: *const lxb_char_t,
        what_size: usize,
    ) -> bool;
}
extern "C" {
    pub fn lexbor_str_data_ncmp(
        first: *const lxb_char_t,
        sec: *const lxb_char_t,
        size: usize,
    ) -> bool;
}
extern "C" {
    pub fn lexbor_str_data_cmp(first: *const lxb_char_t, sec: *const lxb_char_t) -> bool;
}
extern "C" {
    pub fn lexbor_str_data_cmp_ws(first: *const lxb_char_t, sec: *const lxb_char_t) -> bool;
}
extern "C" {
    pub fn lexbor_str_data_to_lowercase(to: *mut lxb_char_t, from: *const lxb_char_t, len: usize);
}
extern "C" {
    pub fn lexbor_str_data_to_uppercase(to: *mut lxb_char_t, from: *const lxb_char_t, len: usize);
}
extern "C" {
    pub fn lexbor_str_data_find_lowercase(data: *const lxb_char_t, len: usize)
        -> *const lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_data_find_uppercase(data: *const lxb_char_t, len: usize)
        -> *const lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_data_noi(str_: *mut lexbor_str_t) -> *mut lxb_char_t;
}
extern "C" {
    pub fn lexbor_str_length_noi(str_: *mut lexbor_str_t) -> usize;
}
extern "C" {
    pub fn lexbor_str_size_noi(str_: *mut lexbor_str_t) -> usize;
}
extern "C" {
    pub fn lexbor_str_data_set_noi(str_: *mut lexbor_str_t, data: *mut lxb_char_t);
}
extern "C" {
    pub fn lexbor_str_length_set_noi(
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
        length: usize,
    ) -> *mut lxb_char_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_shs_entry_t {
    pub key: *mut cty::c_char,
    pub value: *mut cty::c_void,
    pub key_len: usize,
    pub next: usize,
}
#[test]
fn bindgen_test_layout_lexbor_shs_entry_t() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_shs_entry_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_shs_entry_t>(),
        32usize,
        concat!("Size of: ", stringify!(lexbor_shs_entry_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_shs_entry_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_shs_entry_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_shs_entry_t),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_shs_entry_t),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_shs_entry_t),
            "::",
            stringify!(key_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_shs_entry_t),
            "::",
            stringify!(next)
        )
    );
}
impl Default for lexbor_shs_entry_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_shs_hash_t {
    pub key: u32,
    pub value: *mut cty::c_void,
    pub next: usize,
}
#[test]
fn bindgen_test_layout_lexbor_shs_hash_t() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_shs_hash_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_shs_hash_t>(),
        24usize,
        concat!("Size of: ", stringify!(lexbor_shs_hash_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_shs_hash_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_shs_hash_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_shs_hash_t),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_shs_hash_t),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_shs_hash_t),
            "::",
            stringify!(next)
        )
    );
}
impl Default for lexbor_shs_hash_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lexbor_shs_entry_get_static(
        tree: *const lexbor_shs_entry_t,
        key: *const lxb_char_t,
        size: usize,
    ) -> *const lexbor_shs_entry_t;
}
extern "C" {
    pub fn lexbor_shs_entry_get_lower_static(
        root: *const lexbor_shs_entry_t,
        key: *const lxb_char_t,
        key_len: usize,
    ) -> *const lexbor_shs_entry_t;
}
extern "C" {
    pub fn lexbor_shs_entry_get_upper_static(
        root: *const lexbor_shs_entry_t,
        key: *const lxb_char_t,
        key_len: usize,
    ) -> *const lexbor_shs_entry_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lxb_ns_data_t {
    pub entry: lexbor_hash_entry_t,
    pub ns_id: lxb_ns_id_t,
    pub ref_count: usize,
    pub read_only: bool,
}
#[test]
fn bindgen_test_layout_lxb_ns_data_t() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_ns_data_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_ns_data_t>(),
        64usize,
        concat!("Size of: ", stringify!(lxb_ns_data_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_ns_data_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_ns_data_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entry) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_ns_data_t),
            "::",
            stringify!(entry)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ns_id) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_ns_data_t),
            "::",
            stringify!(ns_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ref_count) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_ns_data_t),
            "::",
            stringify!(ref_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).read_only) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_ns_data_t),
            "::",
            stringify!(read_only)
        )
    );
}
impl Default for lxb_ns_data_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lxb_ns_prefix_data_t {
    pub entry: lexbor_hash_entry_t,
    pub prefix_id: lxb_ns_prefix_id_t,
    pub ref_count: usize,
    pub read_only: bool,
}
#[test]
fn bindgen_test_layout_lxb_ns_prefix_data_t() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_ns_prefix_data_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_ns_prefix_data_t>(),
        64usize,
        concat!("Size of: ", stringify!(lxb_ns_prefix_data_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_ns_prefix_data_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_ns_prefix_data_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entry) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_ns_prefix_data_t),
            "::",
            stringify!(entry)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prefix_id) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_ns_prefix_data_t),
            "::",
            stringify!(prefix_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ref_count) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_ns_prefix_data_t),
            "::",
            stringify!(ref_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).read_only) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_ns_prefix_data_t),
            "::",
            stringify!(read_only)
        )
    );
}
impl Default for lxb_ns_prefix_data_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_ns_by_id(
        hash: *mut lexbor_hash_t,
        ns_id: lxb_ns_id_t,
        length: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_ns_data_by_id(hash: *mut lexbor_hash_t, ns_id: lxb_ns_id_t) -> *const lxb_ns_data_t;
}
extern "C" {
    pub fn lxb_ns_data_by_link(
        hash: *mut lexbor_hash_t,
        name: *const lxb_char_t,
        length: usize,
    ) -> *const lxb_ns_data_t;
}
extern "C" {
    pub fn lxb_ns_prefix_append(
        hash: *mut lexbor_hash_t,
        prefix: *const lxb_char_t,
        length: usize,
    ) -> *const lxb_ns_prefix_data_t;
}
extern "C" {
    pub fn lxb_ns_prefix_data_by_id(
        hash: *mut lexbor_hash_t,
        prefix_id: lxb_ns_prefix_id_t,
    ) -> *const lxb_ns_prefix_data_t;
}
extern "C" {
    pub fn lxb_ns_prefix_data_by_name(
        hash: *mut lexbor_hash_t,
        name: *const lxb_char_t,
        length: usize,
    ) -> *const lxb_ns_prefix_data_t;
}
pub type lxb_dom_attr_id_t = usize;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR__UNDEF: lxb_dom_attr_id_enum_t = 0;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_ACTIVE: lxb_dom_attr_id_enum_t = 1;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_ALT: lxb_dom_attr_id_enum_t = 2;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_CHARSET: lxb_dom_attr_id_enum_t = 3;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_CHECKED: lxb_dom_attr_id_enum_t = 4;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_CLASS: lxb_dom_attr_id_enum_t = 5;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_COLOR: lxb_dom_attr_id_enum_t = 6;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_CONTENT: lxb_dom_attr_id_enum_t = 7;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_DIR: lxb_dom_attr_id_enum_t = 8;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_DISABLED: lxb_dom_attr_id_enum_t = 9;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_FACE: lxb_dom_attr_id_enum_t = 10;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_FOCUS: lxb_dom_attr_id_enum_t = 11;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_FOR: lxb_dom_attr_id_enum_t = 12;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_HEIGHT: lxb_dom_attr_id_enum_t = 13;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_HOVER: lxb_dom_attr_id_enum_t = 14;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_HREF: lxb_dom_attr_id_enum_t = 15;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_HTML: lxb_dom_attr_id_enum_t = 16;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_HTTP_EQUIV: lxb_dom_attr_id_enum_t = 17;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_ID: lxb_dom_attr_id_enum_t = 18;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_IS: lxb_dom_attr_id_enum_t = 19;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_MAXLENGTH: lxb_dom_attr_id_enum_t = 20;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_PLACEHOLDER: lxb_dom_attr_id_enum_t = 21;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_POOL: lxb_dom_attr_id_enum_t = 22;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_PUBLIC: lxb_dom_attr_id_enum_t = 23;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_READONLY: lxb_dom_attr_id_enum_t = 24;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_REQUIRED: lxb_dom_attr_id_enum_t = 25;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_SCHEME: lxb_dom_attr_id_enum_t = 26;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_SELECTED: lxb_dom_attr_id_enum_t = 27;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_SIZE: lxb_dom_attr_id_enum_t = 28;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_SLOT: lxb_dom_attr_id_enum_t = 29;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_SRC: lxb_dom_attr_id_enum_t = 30;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_STYLE: lxb_dom_attr_id_enum_t = 31;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_SYSTEM: lxb_dom_attr_id_enum_t = 32;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_TITLE: lxb_dom_attr_id_enum_t = 33;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_TYPE: lxb_dom_attr_id_enum_t = 34;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR_WIDTH: lxb_dom_attr_id_enum_t = 35;
pub const lxb_dom_attr_id_enum_t_LXB_DOM_ATTR__LAST_ENTRY: lxb_dom_attr_id_enum_t = 36;
pub type lxb_dom_attr_id_enum_t = cty::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lxb_dom_attr_data_t {
    pub entry: lexbor_hash_entry_t,
    pub attr_id: lxb_dom_attr_id_t,
    pub ref_count: usize,
    pub read_only: bool,
}
#[test]
fn bindgen_test_layout_lxb_dom_attr_data_t() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_attr_data_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_attr_data_t>(),
        64usize,
        concat!("Size of: ", stringify!(lxb_dom_attr_data_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_attr_data_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_attr_data_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entry) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_attr_data_t),
            "::",
            stringify!(entry)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).attr_id) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_attr_data_t),
            "::",
            stringify!(attr_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ref_count) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_attr_data_t),
            "::",
            stringify!(ref_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).read_only) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_attr_data_t),
            "::",
            stringify!(read_only)
        )
    );
}
impl Default for lxb_dom_attr_data_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_attr {
    pub node: lxb_dom_node_t,
    pub upper_name: lxb_dom_attr_id_t,
    pub qualified_name: lxb_dom_attr_id_t,
    pub value: *mut lexbor_str_t,
    pub owner: *mut lxb_dom_element_t,
    pub next: *mut lxb_dom_attr_t,
    pub prev: *mut lxb_dom_attr_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_attr() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_attr> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_attr>(),
        144usize,
        concat!("Size of: ", stringify!(lxb_dom_attr))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_attr>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_attr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_attr),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).upper_name) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_attr),
            "::",
            stringify!(upper_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qualified_name) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_attr),
            "::",
            stringify!(qualified_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_attr),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).owner) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_attr),
            "::",
            stringify!(owner)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_attr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_attr),
            "::",
            stringify!(prev)
        )
    );
}
impl Default for lxb_dom_attr {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_attr_interface_create(document: *mut lxb_dom_document_t) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_attr_interface_clone(
        document: *mut lxb_dom_document_t,
        attr: *const lxb_dom_attr_t,
    ) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_attr_interface_destroy(attr: *mut lxb_dom_attr_t) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_attr_set_name(
        attr: *mut lxb_dom_attr_t,
        local_name: *const lxb_char_t,
        local_name_len: usize,
        to_lowercase: bool,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_attr_set_value(
        attr: *mut lxb_dom_attr_t,
        value: *const lxb_char_t,
        value_len: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_attr_set_value_wo_copy(
        attr: *mut lxb_dom_attr_t,
        value: *mut lxb_char_t,
        value_len: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_attr_set_existing_value(
        attr: *mut lxb_dom_attr_t,
        value: *const lxb_char_t,
        value_len: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_attr_clone_name_value(
        attr_from: *mut lxb_dom_attr_t,
        attr_to: *mut lxb_dom_attr_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_attr_compare(first: *mut lxb_dom_attr_t, second: *mut lxb_dom_attr_t) -> bool;
}
extern "C" {
    pub fn lxb_dom_attr_remove(attr: *mut lxb_dom_attr_t);
}
extern "C" {
    pub fn lxb_dom_attr_data_undef() -> *const lxb_dom_attr_data_t;
}
extern "C" {
    pub fn lxb_dom_attr_data_by_id(
        hash: *mut lexbor_hash_t,
        attr_id: lxb_dom_attr_id_t,
    ) -> *const lxb_dom_attr_data_t;
}
extern "C" {
    pub fn lxb_dom_attr_data_by_local_name(
        hash: *mut lexbor_hash_t,
        name: *const lxb_char_t,
        length: usize,
    ) -> *const lxb_dom_attr_data_t;
}
extern "C" {
    pub fn lxb_dom_attr_data_by_qualified_name(
        hash: *mut lexbor_hash_t,
        name: *const lxb_char_t,
        length: usize,
    ) -> *const lxb_dom_attr_data_t;
}
extern "C" {
    pub fn lxb_dom_attr_qualified_name(
        attr: *mut lxb_dom_attr_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_attr_local_name_noi(
        attr: *mut lxb_dom_attr_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_attr_value_noi(attr: *mut lxb_dom_attr_t, len: *mut usize) -> *const lxb_char_t;
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct lxb_tag_data_t {
    pub entry: lexbor_hash_entry_t,
    pub tag_id: lxb_tag_id_t,
    pub ref_count: usize,
    pub read_only: bool,
}
#[test]
fn bindgen_test_layout_lxb_tag_data_t() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_tag_data_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_tag_data_t>(),
        64usize,
        concat!("Size of: ", stringify!(lxb_tag_data_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_tag_data_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_tag_data_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entry) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_tag_data_t),
            "::",
            stringify!(entry)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tag_id) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_tag_data_t),
            "::",
            stringify!(tag_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ref_count) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_tag_data_t),
            "::",
            stringify!(ref_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).read_only) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_tag_data_t),
            "::",
            stringify!(read_only)
        )
    );
}
impl Default for lxb_tag_data_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_tag_data_by_id(
        hash: *mut lexbor_hash_t,
        tag_id: lxb_tag_id_t,
    ) -> *const lxb_tag_data_t;
}
extern "C" {
    pub fn lxb_tag_data_by_name(
        hash: *mut lexbor_hash_t,
        name: *const lxb_char_t,
        len: usize,
    ) -> *const lxb_tag_data_t;
}
extern "C" {
    pub fn lxb_tag_data_by_name_upper(
        hash: *mut lexbor_hash_t,
        name: *const lxb_char_t,
        len: usize,
    ) -> *const lxb_tag_data_t;
}
extern "C" {
    pub fn lxb_tag_name_by_id_noi(
        hash: *mut lexbor_hash_t,
        tag_id: lxb_tag_id_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_tag_name_upper_by_id_noi(
        hash: *mut lexbor_hash_t,
        tag_id: lxb_tag_id_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_tag_id_by_name_noi(
        hash: *mut lexbor_hash_t,
        name: *const lxb_char_t,
        len: usize,
    ) -> lxb_tag_id_t;
}
extern "C" {
    pub fn lxb_tag_mraw_noi(hash: *mut lexbor_hash_t) -> *mut lexbor_mraw_t;
}
pub const lxb_dom_element_custom_state_t_LXB_DOM_ELEMENT_CUSTOM_STATE_UNDEFINED:
    lxb_dom_element_custom_state_t = 0;
pub const lxb_dom_element_custom_state_t_LXB_DOM_ELEMENT_CUSTOM_STATE_FAILED:
    lxb_dom_element_custom_state_t = 1;
pub const lxb_dom_element_custom_state_t_LXB_DOM_ELEMENT_CUSTOM_STATE_UNCUSTOMIZED:
    lxb_dom_element_custom_state_t = 2;
pub const lxb_dom_element_custom_state_t_LXB_DOM_ELEMENT_CUSTOM_STATE_CUSTOM:
    lxb_dom_element_custom_state_t = 3;
pub type lxb_dom_element_custom_state_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_element {
    pub node: lxb_dom_node_t,
    pub upper_name: lxb_dom_attr_id_t,
    pub qualified_name: lxb_dom_attr_id_t,
    pub is_value: *mut lexbor_str_t,
    pub first_attr: *mut lxb_dom_attr_t,
    pub last_attr: *mut lxb_dom_attr_t,
    pub attr_id: *mut lxb_dom_attr_t,
    pub attr_class: *mut lxb_dom_attr_t,
    pub custom_state: lxb_dom_element_custom_state_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_element() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_element> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_element>(),
        160usize,
        concat!("Size of: ", stringify!(lxb_dom_element))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_element>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_element))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_element),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).upper_name) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_element),
            "::",
            stringify!(upper_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).qualified_name) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_element),
            "::",
            stringify!(qualified_name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_value) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_element),
            "::",
            stringify!(is_value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).first_attr) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_element),
            "::",
            stringify!(first_attr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).last_attr) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_element),
            "::",
            stringify!(last_attr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).attr_id) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_element),
            "::",
            stringify!(attr_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).attr_class) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_element),
            "::",
            stringify!(attr_class)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).custom_state) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_element),
            "::",
            stringify!(custom_state)
        )
    );
}
impl Default for lxb_dom_element {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_element_interface_create(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_element_t;
}
extern "C" {
    pub fn lxb_dom_element_interface_clone(
        document: *mut lxb_dom_document_t,
        element: *const lxb_dom_element_t,
    ) -> *mut lxb_dom_element_t;
}
extern "C" {
    pub fn lxb_dom_element_interface_destroy(
        element: *mut lxb_dom_element_t,
    ) -> *mut lxb_dom_element_t;
}
extern "C" {
    pub fn lxb_dom_element_interface_copy(
        dst: *mut lxb_dom_element_t,
        src: *const lxb_dom_element_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_element_create(
        document: *mut lxb_dom_document_t,
        local_name: *const lxb_char_t,
        lname_len: usize,
        ns_name: *const lxb_char_t,
        ns_len: usize,
        prefix: *const lxb_char_t,
        prefix_len: usize,
        is: *const lxb_char_t,
        is_len: usize,
        sync_custom: bool,
    ) -> *mut lxb_dom_element_t;
}
extern "C" {
    pub fn lxb_dom_element_destroy(element: *mut lxb_dom_element_t) -> *mut lxb_dom_element_t;
}
extern "C" {
    pub fn lxb_dom_element_has_attributes(element: *mut lxb_dom_element_t) -> bool;
}
extern "C" {
    pub fn lxb_dom_element_set_attribute(
        element: *mut lxb_dom_element_t,
        qualified_name: *const lxb_char_t,
        qn_len: usize,
        value: *const lxb_char_t,
        value_len: usize,
    ) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_element_get_attribute(
        element: *mut lxb_dom_element_t,
        qualified_name: *const lxb_char_t,
        qn_len: usize,
        value_len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_element_remove_attribute(
        element: *mut lxb_dom_element_t,
        qualified_name: *const lxb_char_t,
        qn_len: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_element_has_attribute(
        element: *mut lxb_dom_element_t,
        qualified_name: *const lxb_char_t,
        qn_len: usize,
    ) -> bool;
}
extern "C" {
    pub fn lxb_dom_element_attr_append(
        element: *mut lxb_dom_element_t,
        attr: *mut lxb_dom_attr_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_element_attr_remove(
        element: *mut lxb_dom_element_t,
        attr: *mut lxb_dom_attr_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_element_attr_by_name(
        element: *mut lxb_dom_element_t,
        qualified_name: *const lxb_char_t,
        length: usize,
    ) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_element_attr_by_local_name_data(
        element: *mut lxb_dom_element_t,
        data: *const lxb_dom_attr_data_t,
    ) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_element_attr_by_id(
        element: *mut lxb_dom_element_t,
        attr_id: lxb_dom_attr_id_t,
    ) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_element_attr_by_data(
        element: *mut lxb_dom_element_t,
        data: *const lxb_dom_attr_data_t,
    ) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_element_compare(
        first: *mut lxb_dom_element_t,
        second: *mut lxb_dom_element_t,
    ) -> bool;
}
extern "C" {
    pub fn lxb_dom_element_attr_is_exist(
        element: *mut lxb_dom_element_t,
        qualified_name: *const lxb_char_t,
        length: usize,
    ) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_element_is_set(
        element: *mut lxb_dom_element_t,
        is: *const lxb_char_t,
        is_len: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_elements_by_tag_name(
        root: *mut lxb_dom_element_t,
        collection: *mut lxb_dom_collection_t,
        qualified_name: *const lxb_char_t,
        len: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_elements_by_class_name(
        root: *mut lxb_dom_element_t,
        collection: *mut lxb_dom_collection_t,
        class_name: *const lxb_char_t,
        len: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_elements_by_attr(
        root: *mut lxb_dom_element_t,
        collection: *mut lxb_dom_collection_t,
        qualified_name: *const lxb_char_t,
        qname_len: usize,
        value: *const lxb_char_t,
        value_len: usize,
        case_insensitive: bool,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_elements_by_attr_begin(
        root: *mut lxb_dom_element_t,
        collection: *mut lxb_dom_collection_t,
        qualified_name: *const lxb_char_t,
        qname_len: usize,
        value: *const lxb_char_t,
        value_len: usize,
        case_insensitive: bool,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_elements_by_attr_end(
        root: *mut lxb_dom_element_t,
        collection: *mut lxb_dom_collection_t,
        qualified_name: *const lxb_char_t,
        qname_len: usize,
        value: *const lxb_char_t,
        value_len: usize,
        case_insensitive: bool,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_elements_by_attr_contain(
        root: *mut lxb_dom_element_t,
        collection: *mut lxb_dom_collection_t,
        qualified_name: *const lxb_char_t,
        qname_len: usize,
        value: *const lxb_char_t,
        value_len: usize,
        case_insensitive: bool,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_element_qualified_name(
        element: *mut lxb_dom_element_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_element_qualified_name_upper(
        element: *mut lxb_dom_element_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_element_local_name(
        element: *mut lxb_dom_element_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_element_prefix(
        element: *mut lxb_dom_element_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_element_tag_name(
        element: *mut lxb_dom_element_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_element_id_noi(
        element: *mut lxb_dom_element_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_element_class_noi(
        element: *mut lxb_dom_element_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_element_is_custom_noi(element: *mut lxb_dom_element_t) -> bool;
}
extern "C" {
    pub fn lxb_dom_element_custom_is_defined_noi(element: *mut lxb_dom_element_t) -> bool;
}
extern "C" {
    pub fn lxb_dom_element_first_attribute_noi(
        element: *mut lxb_dom_element_t,
    ) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_element_next_attribute_noi(attr: *mut lxb_dom_attr_t) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_element_prev_attribute_noi(attr: *mut lxb_dom_attr_t) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_element_last_attribute_noi(
        element: *mut lxb_dom_element_t,
    ) -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_element_id_attribute_noi(element: *mut lxb_dom_element_t)
        -> *mut lxb_dom_attr_t;
}
extern "C" {
    pub fn lxb_dom_element_class_attribute_noi(
        element: *mut lxb_dom_element_t,
    ) -> *mut lxb_dom_attr_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_document_fragment {
    pub node: lxb_dom_node_t,
    pub host: *mut lxb_dom_element_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_document_fragment() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_document_fragment> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_document_fragment>(),
        104usize,
        concat!("Size of: ", stringify!(lxb_dom_document_fragment))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_document_fragment>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_document_fragment))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document_fragment),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document_fragment),
            "::",
            stringify!(host)
        )
    );
}
impl Default for lxb_dom_document_fragment {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_document_fragment_interface_create(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_document_fragment_t;
}
extern "C" {
    pub fn lxb_dom_document_fragment_interface_destroy(
        document_fragment: *mut lxb_dom_document_fragment_t,
    ) -> *mut lxb_dom_document_fragment_t;
}
pub const lxb_dom_shadow_root_mode_t_LXB_DOM_SHADOW_ROOT_MODE_OPEN: lxb_dom_shadow_root_mode_t = 0;
pub const lxb_dom_shadow_root_mode_t_LXB_DOM_SHADOW_ROOT_MODE_CLOSED: lxb_dom_shadow_root_mode_t =
    1;
pub type lxb_dom_shadow_root_mode_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_shadow_root {
    pub document_fragment: lxb_dom_document_fragment_t,
    pub mode: lxb_dom_shadow_root_mode_t,
    pub host: *mut lxb_dom_element_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_shadow_root() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_shadow_root> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_shadow_root>(),
        120usize,
        concat!("Size of: ", stringify!(lxb_dom_shadow_root))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_shadow_root>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_shadow_root))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).document_fragment) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_shadow_root),
            "::",
            stringify!(document_fragment)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mode) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_shadow_root),
            "::",
            stringify!(mode)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).host) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_shadow_root),
            "::",
            stringify!(host)
        )
    );
}
impl Default for lxb_dom_shadow_root {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_shadow_root_interface_create(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_shadow_root_t;
}
extern "C" {
    pub fn lxb_dom_shadow_root_interface_destroy(
        shadow_root: *mut lxb_dom_shadow_root_t,
    ) -> *mut lxb_dom_shadow_root_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_character_data {
    pub node: lxb_dom_node_t,
    pub data: lexbor_str_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_character_data() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_character_data> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_character_data>(),
        112usize,
        concat!("Size of: ", stringify!(lxb_dom_character_data))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_character_data>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_character_data))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_character_data),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_character_data),
            "::",
            stringify!(data)
        )
    );
}
impl Default for lxb_dom_character_data {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_character_data_interface_create(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_character_data_t;
}
extern "C" {
    pub fn lxb_dom_character_data_interface_clone(
        document: *mut lxb_dom_document_t,
        ch_data: *const lxb_dom_character_data_t,
    ) -> *mut lxb_dom_character_data_t;
}
extern "C" {
    pub fn lxb_dom_character_data_interface_destroy(
        character_data: *mut lxb_dom_character_data_t,
    ) -> *mut lxb_dom_character_data_t;
}
extern "C" {
    pub fn lxb_dom_character_data_interface_copy(
        dst: *mut lxb_dom_character_data_t,
        src: *const lxb_dom_character_data_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_character_data_replace(
        ch_data: *mut lxb_dom_character_data_t,
        data: *const lxb_char_t,
        len: usize,
        offset: usize,
        count: usize,
    ) -> lxb_status_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_text {
    pub char_data: lxb_dom_character_data_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_text() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_text> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_text>(),
        112usize,
        concat!("Size of: ", stringify!(lxb_dom_text))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_text>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_text))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).char_data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_text),
            "::",
            stringify!(char_data)
        )
    );
}
impl Default for lxb_dom_text {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_text_interface_create(document: *mut lxb_dom_document_t) -> *mut lxb_dom_text_t;
}
extern "C" {
    pub fn lxb_dom_text_interface_clone(
        document: *mut lxb_dom_document_t,
        text: *const lxb_dom_text_t,
    ) -> *mut lxb_dom_text_t;
}
extern "C" {
    pub fn lxb_dom_text_interface_destroy(text: *mut lxb_dom_text_t) -> *mut lxb_dom_text_t;
}
extern "C" {
    pub fn lxb_dom_text_interface_copy(
        dst: *mut lxb_dom_text_t,
        src: *const lxb_dom_text_t,
    ) -> lxb_status_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_cdata_section {
    pub text: lxb_dom_text_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_cdata_section() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_cdata_section> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_cdata_section>(),
        112usize,
        concat!("Size of: ", stringify!(lxb_dom_cdata_section))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_cdata_section>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_cdata_section))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).text) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_cdata_section),
            "::",
            stringify!(text)
        )
    );
}
impl Default for lxb_dom_cdata_section {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_cdata_section_interface_create(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_cdata_section_t;
}
extern "C" {
    pub fn lxb_dom_cdata_section_interface_clone(
        document: *mut lxb_dom_document_t,
        cdata: *const lxb_dom_cdata_section_t,
    ) -> *mut lxb_dom_cdata_section_t;
}
extern "C" {
    pub fn lxb_dom_cdata_section_interface_destroy(
        cdata_section: *mut lxb_dom_cdata_section_t,
    ) -> *mut lxb_dom_cdata_section_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_comment {
    pub char_data: lxb_dom_character_data_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_comment() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_comment> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_comment>(),
        112usize,
        concat!("Size of: ", stringify!(lxb_dom_comment))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_comment>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_comment))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).char_data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_comment),
            "::",
            stringify!(char_data)
        )
    );
}
impl Default for lxb_dom_comment {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_comment_interface_create(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_comment_t;
}
extern "C" {
    pub fn lxb_dom_comment_interface_clone(
        document: *mut lxb_dom_document_t,
        text: *const lxb_dom_comment_t,
    ) -> *mut lxb_dom_comment_t;
}
extern "C" {
    pub fn lxb_dom_comment_interface_destroy(
        comment: *mut lxb_dom_comment_t,
    ) -> *mut lxb_dom_comment_t;
}
extern "C" {
    pub fn lxb_dom_comment_interface_copy(
        dst: *mut lxb_dom_comment_t,
        src: *const lxb_dom_comment_t,
    ) -> lxb_status_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_document_type {
    pub node: lxb_dom_node_t,
    pub name: lxb_dom_attr_id_t,
    pub public_id: lexbor_str_t,
    pub system_id: lexbor_str_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_document_type() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_document_type> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_document_type>(),
        136usize,
        concat!("Size of: ", stringify!(lxb_dom_document_type))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_document_type>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_document_type))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).node) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document_type),
            "::",
            stringify!(node)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document_type),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).public_id) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document_type),
            "::",
            stringify!(public_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).system_id) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_document_type),
            "::",
            stringify!(system_id)
        )
    );
}
impl Default for lxb_dom_document_type {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_document_type_interface_create(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_document_type_t;
}
extern "C" {
    pub fn lxb_dom_document_type_interface_clone(
        document: *mut lxb_dom_document_t,
        dtype: *const lxb_dom_document_type_t,
    ) -> *mut lxb_dom_document_type_t;
}
extern "C" {
    pub fn lxb_dom_document_type_interface_destroy(
        document_type: *mut lxb_dom_document_type_t,
    ) -> *mut lxb_dom_document_type_t;
}
extern "C" {
    pub fn lxb_dom_document_type_name_noi(
        doc_type: *mut lxb_dom_document_type_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_document_type_public_id_noi(
        doc_type: *mut lxb_dom_document_type_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_dom_document_type_system_id_noi(
        doc_type: *mut lxb_dom_document_type_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_dom_processing_instruction {
    pub char_data: lxb_dom_character_data_t,
    pub target: lexbor_str_t,
}
#[test]
fn bindgen_test_layout_lxb_dom_processing_instruction() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_dom_processing_instruction> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_dom_processing_instruction>(),
        128usize,
        concat!("Size of: ", stringify!(lxb_dom_processing_instruction))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_dom_processing_instruction>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_dom_processing_instruction))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).char_data) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_processing_instruction),
            "::",
            stringify!(char_data)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).target) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_dom_processing_instruction),
            "::",
            stringify!(target)
        )
    );
}
impl Default for lxb_dom_processing_instruction {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_dom_processing_instruction_interface_create(
        document: *mut lxb_dom_document_t,
    ) -> *mut lxb_dom_processing_instruction_t;
}
extern "C" {
    pub fn lxb_dom_processing_instruction_interface_clone(
        document: *mut lxb_dom_document_t,
        processing_instruction: *const lxb_dom_processing_instruction_t,
    ) -> *mut lxb_dom_processing_instruction_t;
}
extern "C" {
    pub fn lxb_dom_processing_instruction_interface_destroy(
        processing_instruction: *mut lxb_dom_processing_instruction_t,
    ) -> *mut lxb_dom_processing_instruction_t;
}
extern "C" {
    pub fn lxb_dom_processing_instruction_copy(
        dst: *mut lxb_dom_processing_instruction_t,
        src: *const lxb_dom_processing_instruction_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_dom_processing_instruction_target_noi(
        pi: *mut lxb_dom_processing_instruction_t,
        len: *mut usize,
    ) -> *const lxb_char_t;
}
pub type lxb_html_tokenizer_t = lxb_html_tokenizer;
pub type lxb_html_tokenizer_opt_t = cty::c_uint;
pub type lxb_html_tree_t = lxb_html_tree;
pub const lxb_html_status_t_LXB_HTML_STATUS_OK: lxb_html_status_t = 0;
pub type lxb_html_status_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_array_obj_t {
    pub list: *mut u8,
    pub size: usize,
    pub length: usize,
    pub struct_size: usize,
}
#[test]
fn bindgen_test_layout_lexbor_array_obj_t() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_array_obj_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_array_obj_t>(),
        32usize,
        concat!("Size of: ", stringify!(lexbor_array_obj_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_array_obj_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_array_obj_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).list) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_array_obj_t),
            "::",
            stringify!(list)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_array_obj_t),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_array_obj_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).struct_size) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_array_obj_t),
            "::",
            stringify!(struct_size)
        )
    );
}
impl Default for lexbor_array_obj_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lexbor_array_obj_create() -> *mut lexbor_array_obj_t;
}
extern "C" {
    pub fn lexbor_array_obj_init(
        array: *mut lexbor_array_obj_t,
        size: usize,
        struct_size: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_array_obj_clean(array: *mut lexbor_array_obj_t);
}
extern "C" {
    pub fn lexbor_array_obj_destroy(
        array: *mut lexbor_array_obj_t,
        self_destroy: bool,
    ) -> *mut lexbor_array_obj_t;
}
extern "C" {
    pub fn lexbor_array_obj_expand(array: *mut lexbor_array_obj_t, up_to: usize) -> *mut u8;
}
extern "C" {
    pub fn lexbor_array_obj_push(array: *mut lexbor_array_obj_t) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_array_obj_push_wo_cls(array: *mut lexbor_array_obj_t) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_array_obj_push_n(
        array: *mut lexbor_array_obj_t,
        count: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_array_obj_pop(array: *mut lexbor_array_obj_t) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_array_obj_delete(array: *mut lexbor_array_obj_t, begin: usize, length: usize);
}
extern "C" {
    pub fn lexbor_array_obj_erase_noi(array: *mut lexbor_array_obj_t);
}
extern "C" {
    pub fn lexbor_array_obj_get_noi(array: *mut lexbor_array_obj_t, idx: usize)
        -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_array_obj_length_noi(array: *mut lexbor_array_obj_t) -> usize;
}
extern "C" {
    pub fn lexbor_array_obj_size_noi(array: *mut lexbor_array_obj_t) -> usize;
}
extern "C" {
    pub fn lexbor_array_obj_struct_size_noi(array: *mut lexbor_array_obj_t) -> usize;
}
extern "C" {
    pub fn lexbor_array_obj_last_noi(array: *mut lexbor_array_obj_t) -> *mut cty::c_void;
}
pub type lxb_html_token_attr_t = lxb_html_token_attr;
pub type lxb_html_token_attr_type_t = cty::c_int;
pub const lxb_html_token_attr_type_LXB_HTML_TOKEN_ATTR_TYPE_UNDEF: lxb_html_token_attr_type = 0;
pub const lxb_html_token_attr_type_LXB_HTML_TOKEN_ATTR_TYPE_NAME_NULL: lxb_html_token_attr_type = 1;
pub const lxb_html_token_attr_type_LXB_HTML_TOKEN_ATTR_TYPE_VALUE_NULL: lxb_html_token_attr_type =
    2;
pub type lxb_html_token_attr_type = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_html_token_attr {
    pub name_begin: *const lxb_char_t,
    pub name_end: *const lxb_char_t,
    pub value_begin: *const lxb_char_t,
    pub value_end: *const lxb_char_t,
    pub name: *const lxb_dom_attr_data_t,
    pub value: *mut lxb_char_t,
    pub value_size: usize,
    pub next: *mut lxb_html_token_attr_t,
    pub prev: *mut lxb_html_token_attr_t,
    pub type_: lxb_html_token_attr_type_t,
}
#[test]
fn bindgen_test_layout_lxb_html_token_attr() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_html_token_attr> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_html_token_attr>(),
        80usize,
        concat!("Size of: ", stringify!(lxb_html_token_attr))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_html_token_attr>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_html_token_attr))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_begin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_attr),
            "::",
            stringify!(name_begin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name_end) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_attr),
            "::",
            stringify!(name_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_begin) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_attr),
            "::",
            stringify!(value_begin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_end) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_attr),
            "::",
            stringify!(value_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_attr),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_attr),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_size) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_attr),
            "::",
            stringify!(value_size)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_attr),
            "::",
            stringify!(next)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).prev) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_attr),
            "::",
            stringify!(prev)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_attr),
            "::",
            stringify!(type_)
        )
    );
}
impl Default for lxb_html_token_attr {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_html_token_attr_create(dobj: *mut lexbor_dobject_t) -> *mut lxb_html_token_attr_t;
}
extern "C" {
    pub fn lxb_html_token_attr_clean(attr: *mut lxb_html_token_attr_t);
}
extern "C" {
    pub fn lxb_html_token_attr_destroy(
        attr: *mut lxb_html_token_attr_t,
        dobj: *mut lexbor_dobject_t,
    ) -> *mut lxb_html_token_attr_t;
}
extern "C" {
    pub fn lxb_html_token_attr_name(
        attr: *mut lxb_html_token_attr_t,
        length: *mut usize,
    ) -> *const lxb_char_t;
}
pub type lxb_html_token_type_t = cty::c_int;
pub const lxb_html_token_type_LXB_HTML_TOKEN_TYPE_OPEN: lxb_html_token_type = 0;
pub const lxb_html_token_type_LXB_HTML_TOKEN_TYPE_CLOSE: lxb_html_token_type = 1;
pub const lxb_html_token_type_LXB_HTML_TOKEN_TYPE_CLOSE_SELF: lxb_html_token_type = 2;
pub const lxb_html_token_type_LXB_HTML_TOKEN_TYPE_FORCE_QUIRKS: lxb_html_token_type = 4;
pub const lxb_html_token_type_LXB_HTML_TOKEN_TYPE_DONE: lxb_html_token_type = 8;
pub type lxb_html_token_type = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_html_token_t {
    pub begin: *const lxb_char_t,
    pub end: *const lxb_char_t,
    pub text_start: *const lxb_char_t,
    pub text_end: *const lxb_char_t,
    pub attr_first: *mut lxb_html_token_attr_t,
    pub attr_last: *mut lxb_html_token_attr_t,
    pub base_element: *mut cty::c_void,
    pub null_count: usize,
    pub tag_id: lxb_tag_id_t,
    pub type_: lxb_html_token_type_t,
}
#[test]
fn bindgen_test_layout_lxb_html_token_t() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_html_token_t> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_html_token_t>(),
        80usize,
        concat!("Size of: ", stringify!(lxb_html_token_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_html_token_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_html_token_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).begin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_t),
            "::",
            stringify!(begin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_t),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).text_start) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_t),
            "::",
            stringify!(text_start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).text_end) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_t),
            "::",
            stringify!(text_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).attr_first) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_t),
            "::",
            stringify!(attr_first)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).attr_last) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_t),
            "::",
            stringify!(attr_last)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).base_element) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_t),
            "::",
            stringify!(base_element)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).null_count) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_t),
            "::",
            stringify!(null_count)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tag_id) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_t),
            "::",
            stringify!(tag_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_token_t),
            "::",
            stringify!(type_)
        )
    );
}
impl Default for lxb_html_token_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_html_token_create(dobj: *mut lexbor_dobject_t) -> *mut lxb_html_token_t;
}
extern "C" {
    pub fn lxb_html_token_destroy(
        token: *mut lxb_html_token_t,
        dobj: *mut lexbor_dobject_t,
    ) -> *mut lxb_html_token_t;
}
extern "C" {
    pub fn lxb_html_token_attr_append(
        token: *mut lxb_html_token_t,
        dobj: *mut lexbor_dobject_t,
    ) -> *mut lxb_html_token_attr_t;
}
extern "C" {
    pub fn lxb_html_token_attr_remove(
        token: *mut lxb_html_token_t,
        attr: *mut lxb_html_token_attr_t,
    );
}
extern "C" {
    pub fn lxb_html_token_attr_delete(
        token: *mut lxb_html_token_t,
        attr: *mut lxb_html_token_attr_t,
        dobj: *mut lexbor_dobject_t,
    );
}
extern "C" {
    pub fn lxb_html_token_make_text(
        token: *mut lxb_html_token_t,
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_token_make_text_drop_null(
        token: *mut lxb_html_token_t,
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_token_make_text_replace_null(
        token: *mut lxb_html_token_t,
        str_: *mut lexbor_str_t,
        mraw: *mut lexbor_mraw_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_token_data_skip_ws_begin(token: *mut lxb_html_token_t) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_token_data_skip_one_newline_begin(token: *mut lxb_html_token_t)
        -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_token_data_split_ws_begin(
        token: *mut lxb_html_token_t,
        ws_token: *mut lxb_html_token_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_token_doctype_parse(
        token: *mut lxb_html_token_t,
        doc_type: *mut lxb_dom_document_type_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_token_find_attr(
        tkz: *mut lxb_html_tokenizer_t,
        token: *mut lxb_html_token_t,
        name: *const lxb_char_t,
        name_len: usize,
    ) -> *mut lxb_html_token_attr_t;
}
extern "C" {
    pub fn lxb_html_token_clean_noi(token: *mut lxb_html_token_t);
}
extern "C" {
    pub fn lxb_html_token_create_eof_noi(dobj: *mut lexbor_dobject_t) -> *mut lxb_html_token_t;
}
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_UNTO: lxb_html_tree_error_id_t = 0;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_UNCLTO: lxb_html_tree_error_id_t = 1;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_NUCH: lxb_html_tree_error_id_t = 2;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_UNCHTO: lxb_html_tree_error_id_t = 3;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_UNTOININMO: lxb_html_tree_error_id_t = 4;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_BADOTOININMO: lxb_html_tree_error_id_t = 5;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOINBEHTMO: lxb_html_tree_error_id_t = 6;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_UNCLTOINBEHTMO: lxb_html_tree_error_id_t =
    7;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOINBEHEMO: lxb_html_tree_error_id_t = 8;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_UNCLTOINBEHEMO: lxb_html_tree_error_id_t =
    9;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOINHEMO: lxb_html_tree_error_id_t = 10;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_NOVOHTELSTTAWITRSO:
    lxb_html_tree_error_id_t = 11;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_HETOINHEMO: lxb_html_tree_error_id_t = 12;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_UNCLTOINHEMO: lxb_html_tree_error_id_t = 13;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_TECLTOWIOPINHEMO: lxb_html_tree_error_id_t =
    14;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_TEELISNOCUINHEMO: lxb_html_tree_error_id_t =
    15;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOINHENOMO: lxb_html_tree_error_id_t = 16;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOAFHEMO: lxb_html_tree_error_id_t = 17;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_HETOAFHEMO: lxb_html_tree_error_id_t = 18;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOINBOMO: lxb_html_tree_error_id_t = 19;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_BAENOPELISWR: lxb_html_tree_error_id_t = 20;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_OPELISWR: lxb_html_tree_error_id_t = 21;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_UNELINOPELST: lxb_html_tree_error_id_t = 22;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_MIELINOPELST: lxb_html_tree_error_id_t = 23;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_NOBOELINSC: lxb_html_tree_error_id_t = 24;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_MIELINSC: lxb_html_tree_error_id_t = 25;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_UNELINSC: lxb_html_tree_error_id_t = 26;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_UNELINACFOST: lxb_html_tree_error_id_t = 27;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_UNENOFFI: lxb_html_tree_error_id_t = 28;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_CHINTATE: lxb_html_tree_error_id_t = 29;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOINTAMO: lxb_html_tree_error_id_t = 30;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOINSEMO: lxb_html_tree_error_id_t = 31;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOAFBOMO: lxb_html_tree_error_id_t = 32;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOINFRMO: lxb_html_tree_error_id_t = 33;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOAFFRMO: lxb_html_tree_error_id_t = 34;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_DOTOFOCOMO: lxb_html_tree_error_id_t = 35;
pub const lxb_html_tree_error_id_t_LXB_HTML_RULES_ERROR_LAST_ENTRY: lxb_html_tree_error_id_t = 36;
pub type lxb_html_tree_error_id_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_html_tree_error_t {
    pub id: lxb_html_tree_error_id_t,
    pub begin: *const lxb_char_t,
    pub end: *const lxb_char_t,
}
#[test]
fn bindgen_test_layout_lxb_html_tree_error_t() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_html_tree_error_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_html_tree_error_t>(),
        24usize,
        concat!("Size of: ", stringify!(lxb_html_tree_error_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_html_tree_error_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_html_tree_error_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tree_error_t),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).begin) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tree_error_t),
            "::",
            stringify!(begin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tree_error_t),
            "::",
            stringify!(end)
        )
    );
}
impl Default for lxb_html_tree_error_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_html_tree_error_add(
        parse_errors: *mut lexbor_array_obj_t,
        token: *mut lxb_html_token_t,
        id: lxb_html_tree_error_id_t,
    ) -> *mut lxb_html_tree_error_t;
}
extern "C" {
    pub fn lxb_html_node_is_void_noi(node: *mut lxb_dom_node_t) -> bool;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_sbst_entry_static_t {
    pub key: lxb_char_t,
    pub value: *mut cty::c_void,
    pub value_len: usize,
    pub left: usize,
    pub right: usize,
    pub next: usize,
}
#[test]
fn bindgen_test_layout_lexbor_sbst_entry_static_t() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_sbst_entry_static_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_sbst_entry_static_t>(),
        48usize,
        concat!("Size of: ", stringify!(lexbor_sbst_entry_static_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_sbst_entry_static_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_sbst_entry_static_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_sbst_entry_static_t),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_sbst_entry_static_t),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value_len) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_sbst_entry_static_t),
            "::",
            stringify!(value_len)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_sbst_entry_static_t),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).right) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_sbst_entry_static_t),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).next) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_sbst_entry_static_t),
            "::",
            stringify!(next)
        )
    );
}
impl Default for lexbor_sbst_entry_static_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type lxb_html_tokenizer_state_f = ::core::option::Option<
    unsafe extern "C" fn(
        tkz: *mut lxb_html_tokenizer_t,
        data: *const lxb_char_t,
        end: *const lxb_char_t,
    ) -> *const lxb_char_t,
>;
pub type lxb_html_tokenizer_token_f = ::core::option::Option<
    unsafe extern "C" fn(
        tkz: *mut lxb_html_tokenizer_t,
        token: *mut lxb_html_token_t,
        ctx: *mut cty::c_void,
    ) -> *mut lxb_html_token_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_html_tokenizer {
    pub state: lxb_html_tokenizer_state_f,
    pub state_return: lxb_html_tokenizer_state_f,
    pub callback_token_done: lxb_html_tokenizer_token_f,
    pub callback_token_ctx: *mut cty::c_void,
    pub tags: *mut lexbor_hash_t,
    pub attrs: *mut lexbor_hash_t,
    pub attrs_mraw: *mut lexbor_mraw_t,
    pub mraw: *mut lexbor_mraw_t,
    pub token: *mut lxb_html_token_t,
    pub dobj_token: *mut lexbor_dobject_t,
    pub dobj_token_attr: *mut lexbor_dobject_t,
    pub parse_errors: *mut lexbor_array_obj_t,
    pub tree: *mut lxb_html_tree_t,
    pub markup: *const lxb_char_t,
    pub temp: *const lxb_char_t,
    pub tmp_tag_id: lxb_tag_id_t,
    pub start: *mut lxb_char_t,
    pub pos: *mut lxb_char_t,
    pub end: *const lxb_char_t,
    pub begin: *const lxb_char_t,
    pub last: *const lxb_char_t,
    pub entity: *const lexbor_sbst_entry_static_t,
    pub entity_match: *const lexbor_sbst_entry_static_t,
    pub entity_start: usize,
    pub entity_end: usize,
    pub entity_length: u32,
    pub entity_number: u32,
    pub is_attribute: bool,
    pub opt: lxb_html_tokenizer_opt_t,
    pub status: lxb_status_t,
    pub is_eof: bool,
    pub base: *mut lxb_html_tokenizer_t,
    pub ref_count: usize,
}
#[test]
fn bindgen_test_layout_lxb_html_tokenizer() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_html_tokenizer> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_html_tokenizer>(),
        240usize,
        concat!("Size of: ", stringify!(lxb_html_tokenizer))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_html_tokenizer>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_html_tokenizer))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).state) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(state)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).state_return) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(state_return)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).callback_token_done) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(callback_token_done)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).callback_token_ctx) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(callback_token_ctx)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tags) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(tags)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).attrs) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(attrs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).attrs_mraw) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(attrs_mraw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mraw) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(mraw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).token) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(token)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dobj_token) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(dobj_token)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).dobj_token_attr) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(dobj_token_attr)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).parse_errors) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(parse_errors)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tree) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(tree)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).markup) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(markup)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).temp) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(temp)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tmp_tag_id) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(tmp_tag_id)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).begin) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(begin)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).last) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(last)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entity) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(entity)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entity_match) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(entity_match)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entity_start) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(entity_start)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entity_end) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(entity_end)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entity_length) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(entity_length)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).entity_number) as usize - ptr as usize },
        204usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(entity_number)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_attribute) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(is_attribute)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).opt) as usize - ptr as usize },
        212usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(opt)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).status) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(status)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).is_eof) as usize - ptr as usize },
        220usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(is_eof)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).base) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(base)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ref_count) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer),
            "::",
            stringify!(ref_count)
        )
    );
}
impl Default for lxb_html_tokenizer {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_ABCLOFEMCO:
    lxb_html_tokenizer_error_id_t = 0;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_ABDOPUID:
    lxb_html_tokenizer_error_id_t = 1;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_ABDOSYID:
    lxb_html_tokenizer_error_id_t = 2;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_ABOFDIINNUCHRE:
    lxb_html_tokenizer_error_id_t = 3;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_CDINHTCO:
    lxb_html_tokenizer_error_id_t = 4;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_CHREOUUNRA:
    lxb_html_tokenizer_error_id_t = 5;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_COCHININST:
    lxb_html_tokenizer_error_id_t = 6;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_COCHRE:
    lxb_html_tokenizer_error_id_t = 7;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_ENTAWIAT:
    lxb_html_tokenizer_error_id_t = 8;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_DUAT:
    lxb_html_tokenizer_error_id_t = 9;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_ENTAWITRSO:
    lxb_html_tokenizer_error_id_t = 10;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_EOBETANA:
    lxb_html_tokenizer_error_id_t = 11;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_EOINCD:
    lxb_html_tokenizer_error_id_t = 12;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_EOINCO:
    lxb_html_tokenizer_error_id_t = 13;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_EOINDO:
    lxb_html_tokenizer_error_id_t = 14;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_EOINSCHTCOLITE:
    lxb_html_tokenizer_error_id_t = 15;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_EOINTA:
    lxb_html_tokenizer_error_id_t = 16;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_INCLCO:
    lxb_html_tokenizer_error_id_t = 17;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_INOPCO:
    lxb_html_tokenizer_error_id_t = 18;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_INCHSEAFDONA:
    lxb_html_tokenizer_error_id_t = 19;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_INFICHOFTANA:
    lxb_html_tokenizer_error_id_t = 20;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIATVA:
    lxb_html_tokenizer_error_id_t = 21;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIDONA:
    lxb_html_tokenizer_error_id_t = 22;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIDOPUID:
    lxb_html_tokenizer_error_id_t = 23;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIDOSYID:
    lxb_html_tokenizer_error_id_t = 24;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIENTANA:
    lxb_html_tokenizer_error_id_t = 25;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIQUBEDOPUID:
    lxb_html_tokenizer_error_id_t = 26;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIQUBEDOSYID:
    lxb_html_tokenizer_error_id_t = 27;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MISEAFCHRE:
    lxb_html_tokenizer_error_id_t = 28;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIWHAFDOPUKE:
    lxb_html_tokenizer_error_id_t = 29;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIWHAFDOSYKE:
    lxb_html_tokenizer_error_id_t = 30;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIWHBEDONA:
    lxb_html_tokenizer_error_id_t = 31;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIWHBEAT:
    lxb_html_tokenizer_error_id_t = 32;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_MIWHBEDOPUANSYID:
    lxb_html_tokenizer_error_id_t = 33;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_NECO:
    lxb_html_tokenizer_error_id_t = 34;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_NOCHRE:
    lxb_html_tokenizer_error_id_t = 35;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_NOININST:
    lxb_html_tokenizer_error_id_t = 36;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_NOVOHTELSTTAWITRSO:
    lxb_html_tokenizer_error_id_t = 37;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_NUCHRE:
    lxb_html_tokenizer_error_id_t = 38;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_SUCHRE:
    lxb_html_tokenizer_error_id_t = 39;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_SUININST:
    lxb_html_tokenizer_error_id_t = 40;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_UNCHAFDOSYID:
    lxb_html_tokenizer_error_id_t = 41;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_UNCHINATNA:
    lxb_html_tokenizer_error_id_t = 42;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_UNCHINUNATVA:
    lxb_html_tokenizer_error_id_t = 43;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_UNEQSIBEATNA:
    lxb_html_tokenizer_error_id_t = 44;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_UNNUCH:
    lxb_html_tokenizer_error_id_t = 45;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_UNQUMAINOFTANA:
    lxb_html_tokenizer_error_id_t = 46;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_UNSOINTA:
    lxb_html_tokenizer_error_id_t = 47;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_UNNACHRE:
    lxb_html_tokenizer_error_id_t = 48;
pub const lxb_html_tokenizer_error_id_t_LXB_HTML_TOKENIZER_ERROR_LAST_ENTRY:
    lxb_html_tokenizer_error_id_t = 49;
pub type lxb_html_tokenizer_error_id_t = cty::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_html_tokenizer_error_t {
    pub pos: *const lxb_char_t,
    pub id: lxb_html_tokenizer_error_id_t,
}
#[test]
fn bindgen_test_layout_lxb_html_tokenizer_error_t() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_html_tokenizer_error_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_html_tokenizer_error_t>(),
        16usize,
        concat!("Size of: ", stringify!(lxb_html_tokenizer_error_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_html_tokenizer_error_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_html_tokenizer_error_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).pos) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer_error_t),
            "::",
            stringify!(pos)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_html_tokenizer_error_t),
            "::",
            stringify!(id)
        )
    );
}
impl Default for lxb_html_tokenizer_error_t {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lxb_html_tokenizer_error_add(
        parse_errors: *mut lexbor_array_obj_t,
        pos: *const lxb_char_t,
        id: lxb_html_tokenizer_error_id_t,
    ) -> *mut lxb_html_tokenizer_error_t;
}
extern "C" {
    pub static mut lxb_html_tokenizer_eof: *const lxb_char_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_create() -> *mut lxb_html_tokenizer_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_init(tkz: *mut lxb_html_tokenizer_t) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_inherit(
        tkz_to: *mut lxb_html_tokenizer_t,
        tkz_from: *mut lxb_html_tokenizer_t,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_ref(tkz: *mut lxb_html_tokenizer_t) -> *mut lxb_html_tokenizer_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_unref(tkz: *mut lxb_html_tokenizer_t) -> *mut lxb_html_tokenizer_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_clean(tkz: *mut lxb_html_tokenizer_t);
}
extern "C" {
    pub fn lxb_html_tokenizer_destroy(tkz: *mut lxb_html_tokenizer_t) -> *mut lxb_html_tokenizer_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_tags_make(
        tkz: *mut lxb_html_tokenizer_t,
        table_size: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_tags_destroy(tkz: *mut lxb_html_tokenizer_t);
}
extern "C" {
    pub fn lxb_html_tokenizer_attrs_make(
        tkz: *mut lxb_html_tokenizer_t,
        table_size: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_attrs_destroy(tkz: *mut lxb_html_tokenizer_t);
}
extern "C" {
    pub fn lxb_html_tokenizer_begin(tkz: *mut lxb_html_tokenizer_t) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_chunk(
        tkz: *mut lxb_html_tokenizer_t,
        data: *const lxb_char_t,
        size: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_end(tkz: *mut lxb_html_tokenizer_t) -> lxb_status_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_change_incoming(
        tkz: *mut lxb_html_tokenizer_t,
        pos: *const lxb_char_t,
    ) -> *const lxb_char_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_current_namespace(tkz: *mut lxb_html_tokenizer_t) -> lxb_ns_id_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_set_state_by_tag(
        tkz: *mut lxb_html_tokenizer_t,
        scripting: bool,
        tag_id: lxb_tag_id_t,
        ns: lxb_ns_id_t,
    );
}
extern "C" {
    pub fn lxb_html_tokenizer_status_set_noi(tkz: *mut lxb_html_tokenizer_t, status: lxb_status_t);
}
extern "C" {
    pub fn lxb_html_tokenizer_callback_token_done_set_noi(
        tkz: *mut lxb_html_tokenizer_t,
        call_func: lxb_html_tokenizer_token_f,
        ctx: *mut cty::c_void,
    );
}
extern "C" {
    pub fn lxb_html_tokenizer_callback_token_done_ctx_noi(
        tkz: *mut lxb_html_tokenizer_t,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lxb_html_tokenizer_state_set_noi(
        tkz: *mut lxb_html_tokenizer_t,
        state: lxb_html_tokenizer_state_f,
    );
}
extern "C" {
    pub fn lxb_html_tokenizer_tmp_tag_id_set_noi(
        tkz: *mut lxb_html_tokenizer_t,
        tag_id: lxb_tag_id_t,
    );
}
extern "C" {
    pub fn lxb_html_tokenizer_tree_noi(tkz: *mut lxb_html_tokenizer_t) -> *mut lxb_html_tree_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_tree_set_noi(
        tkz: *mut lxb_html_tokenizer_t,
        tree: *mut lxb_html_tree_t,
    );
}
extern "C" {
    pub fn lxb_html_tokenizer_mraw_noi(tkz: *mut lxb_html_tokenizer_t) -> *mut lexbor_mraw_t;
}
extern "C" {
    pub fn lxb_html_tokenizer_tags_noi(tkz: *mut lxb_html_tokenizer_t) -> *mut lexbor_hash_t;
}
pub type lexbor_avl_t = lexbor_avl;
pub type lexbor_avl_node_t = lexbor_avl_node;
pub type lexbor_avl_node_f = ::core::option::Option<
    unsafe extern "C" fn(
        avl: *mut lexbor_avl_t,
        root: *mut *mut lexbor_avl_node_t,
        node: *mut lexbor_avl_node_t,
        ctx: *mut cty::c_void,
    ) -> lxb_status_t,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_avl_node {
    pub type_: usize,
    pub height: cty::c_short,
    pub value: *mut cty::c_void,
    pub left: *mut lexbor_avl_node_t,
    pub right: *mut lexbor_avl_node_t,
    pub parent: *mut lexbor_avl_node_t,
}
#[test]
fn bindgen_test_layout_lexbor_avl_node() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_avl_node> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_avl_node>(),
        48usize,
        concat!("Size of: ", stringify!(lexbor_avl_node))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_avl_node>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_avl_node))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_avl_node),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).height) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_avl_node),
            "::",
            stringify!(height)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_avl_node),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).left) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_avl_node),
            "::",
            stringify!(left)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).right) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_avl_node),
            "::",
            stringify!(right)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).parent) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_avl_node),
            "::",
            stringify!(parent)
        )
    );
}
impl Default for lexbor_avl_node {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lexbor_avl {
    pub nodes: *mut lexbor_dobject_t,
    pub last_right: *mut lexbor_avl_node_t,
}
#[test]
fn bindgen_test_layout_lexbor_avl() {
    const UNINIT: ::core::mem::MaybeUninit<lexbor_avl> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lexbor_avl>(),
        16usize,
        concat!("Size of: ", stringify!(lexbor_avl))
    );
    assert_eq!(
        ::core::mem::align_of::<lexbor_avl>(),
        8usize,
        concat!("Alignment of ", stringify!(lexbor_avl))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).nodes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_avl),
            "::",
            stringify!(nodes)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).last_right) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lexbor_avl),
            "::",
            stringify!(last_right)
        )
    );
}
impl Default for lexbor_avl {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn lexbor_avl_create() -> *mut lexbor_avl_t;
}
extern "C" {
    pub fn lexbor_avl_init(
        avl: *mut lexbor_avl_t,
        chunk_len: usize,
        struct_size: usize,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_avl_clean(avl: *mut lexbor_avl_t);
}
extern "C" {
    pub fn lexbor_avl_destroy(avl: *mut lexbor_avl_t, self_destroy: bool) -> *mut lexbor_avl_t;
}
extern "C" {
    pub fn lexbor_avl_node_make(
        avl: *mut lexbor_avl_t,
        type_: usize,
        value: *mut cty::c_void,
    ) -> *mut lexbor_avl_node_t;
}
extern "C" {
    pub fn lexbor_avl_node_clean(node: *mut lexbor_avl_node_t);
}
extern "C" {
    pub fn lexbor_avl_node_destroy(
        avl: *mut lexbor_avl_t,
        node: *mut lexbor_avl_node_t,
        self_destroy: bool,
    ) -> *mut lexbor_avl_node_t;
}
extern "C" {
    pub fn lexbor_avl_insert(
        avl: *mut lexbor_avl_t,
        scope: *mut *mut lexbor_avl_node_t,
        type_: usize,
        value: *mut cty::c_void,
    ) -> *mut lexbor_avl_node_t;
}
extern "C" {
    pub fn lexbor_avl_search(
        avl: *mut lexbor_avl_t,
        scope: *mut lexbor_avl_node_t,
        type_: usize,
    ) -> *mut lexbor_avl_node_t;
}
extern "C" {
    pub fn lexbor_avl_remove(
        avl: *mut lexbor_avl_t,
        scope: *mut *mut lexbor_avl_node_t,
        type_: usize,
    ) -> *mut cty::c_void;
}
extern "C" {
    pub fn lexbor_avl_remove_by_node(
        avl: *mut lexbor_avl_t,
        root: *mut *mut lexbor_avl_node_t,
        node: *mut lexbor_avl_node_t,
    );
}
extern "C" {
    pub fn lexbor_avl_foreach(
        avl: *mut lexbor_avl_t,
        scope: *mut *mut lexbor_avl_node_t,
        cb: lexbor_avl_node_f,
        ctx: *mut cty::c_void,
    ) -> lxb_status_t;
}
extern "C" {
    pub fn lexbor_avl_foreach_recursion(
        avl: *mut lexbor_avl_t,
        scope: *mut lexbor_avl_node_t,
        callback: lexbor_avl_node_f,
        ctx: *mut cty::c_void,
    );
}
pub type lxb_html_document_t = lxb_html_document;
pub type lxb_html_anchor_element_t = lxb_html_anchor_element;
pub type lxb_html_area_element_t = lxb_html_area_element;
pub type lxb_html_audio_element_t = lxb_html_audio_element;
pub type lxb_html_br_element_t = lxb_html_br_element;
pub type lxb_html_base_element_t = lxb_html_base_element;
pub type lxb_html_body_element_t = lxb_html_body_element;
pub type lxb_html_button_element_t = lxb_html_button_element;
pub type lxb_html_canvas_element_t = lxb_html_canvas_element;
pub type lxb_html_d_list_element_t = lxb_html_d_list_element;
pub type lxb_html_data_element_t = lxb_html_data_element;
pub type lxb_html_data_list_element_t = lxb_html_data_list_element;
pub type lxb_html_details_element_t = lxb_html_details_element;
pub type lxb_html_dialog_element_t = lxb_html_dialog_element;
pub type lxb_html_directory_element_t = lxb_html_directory_element;
pub type lxb_html_div_element_t = lxb_html_div_element;
pub type lxb_html_element_t = lxb_html_element;
pub type lxb_html_embed_element_t = lxb_html_embed_element;
pub type lxb_html_field_set_element_t = lxb_html_field_set_element;
pub type lxb_html_font_element_t = lxb_html_font_element;
pub type lxb_html_form_element_t = lxb_html_form_element;
pub type lxb_html_frame_element_t = lxb_html_frame_element;
pub type lxb_html_frame_set_element_t = lxb_html_frame_set_element;
pub type lxb_html_hr_element_t = lxb_html_hr_element;
pub type lxb_html_head_element_t = lxb_html_head_element;
pub type lxb_html_heading_element_t = lxb_html_heading_element;
pub type lxb_html_html_element_t = lxb_html_html_element;
pub type lxb_html_iframe_element_t = lxb_html_iframe_element;
pub type lxb_html_image_element_t = lxb_html_image_element;
pub type lxb_html_input_element_t = lxb_html_input_element;
pub type lxb_html_li_element_t = lxb_html_li_element;
pub type lxb_html_label_element_t = lxb_html_label_element;
pub type lxb_html_legend_element_t = lxb_html_legend_element;
pub type lxb_html_link_element_t = lxb_html_link_element;
pub type lxb_html_map_element_t = lxb_html_map_element;
pub type lxb_html_marquee_element_t = lxb_html_marquee_element;
pub type lxb_html_media_element_t = lxb_html_media_element;
pub type lxb_html_menu_element_t = lxb_html_menu_element;
pub type lxb_html_meta_element_t = lxb_html_meta_element;
pub type lxb_html_meter_element_t = lxb_html_meter_element;
pub type lxb_html_mod_element_t = lxb_html_mod_element;
pub type lxb_html_o_list_element_t = lxb_html_o_list_element;
pub type lxb_html_object_element_t = lxb_html_object_element;
pub type lxb_html_opt_group_element_t = lxb_html_opt_group_element;
pub type lxb_html_option_element_t = lxb_html_option_element;
pub type lxb_html_output_element_t = lxb_html_output_element;
pub type lxb_html_paragraph_element_t = lxb_html_paragraph_element;
pub type lxb_html_param_element_t = lxb_html_param_element;
pub type lxb_html_picture_element_t = lxb_html_picture_element;
pub type lxb_html_pre_element_t = lxb_html_pre_element;
pub type lxb_html_progress_element_t = lxb_html_progress_element;
pub type lxb_html_quote_element_t = lxb_html_quote_element;
pub type lxb_html_script_element_t = lxb_html_script_element;
pub type lxb_html_select_element_t = lxb_html_select_element;
pub type lxb_html_slot_element_t = lxb_html_slot_element;
pub type lxb_html_source_element_t = lxb_html_source_element;
pub type lxb_html_span_element_t = lxb_html_span_element;
pub type lxb_html_style_element_t = lxb_html_style_element;
pub type lxb_html_table_caption_element_t = lxb_html_table_caption_element;
pub type lxb_html_table_cell_element_t = lxb_html_table_cell_element;
pub type lxb_html_table_col_element_t = lxb_html_table_col_element;
pub type lxb_html_table_element_t = lxb_html_table_element;
pub type lxb_html_table_row_element_t = lxb_html_table_row_element;
pub type lxb_html_table_section_element_t = lxb_html_table_section_element;
pub type lxb_html_template_element_t = lxb_html_template_element;
pub type lxb_html_text_area_element_t = lxb_html_text_area_element;
pub type lxb_html_time_element_t = lxb_html_time_element;
pub type lxb_html_title_element_t = lxb_html_title_element;
pub type lxb_html_track_element_t = lxb_html_track_element;
pub type lxb_html_u_list_element_t = lxb_html_u_list_element;
pub type lxb_html_unknown_element_t = lxb_html_unknown_element;
pub type lxb_html_video_element_t = lxb_html_video_element;
pub type lxb_html_window_t = lxb_html_window;
extern "C" {
    pub fn lxb_html_interface_create(
        document: *mut lxb_html_document_t,
        tag_id: lxb_tag_id_t,
        ns: lxb_ns_id_t,
    ) -> *mut lxb_dom_interface_t;
}
extern "C" {
    pub fn lxb_html_interface_clone(
        document: *mut lxb_dom_document_t,
        intrfc: *const lxb_dom_interface_t,
    ) -> *mut lxb_dom_interface_t;
}
extern "C" {
    pub fn lxb_html_interface_destroy(intrfc: *mut lxb_dom_interface_t)
        -> *mut lxb_dom_interface_t;
}
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_css_memory {
    pub objs: *mut lexbor_dobject_t,
    pub mraw: *mut lexbor_mraw_t,
    pub tree: *mut lexbor_mraw_t,
    pub ref_count: usize,
}
#[test]
fn bindgen_test_layout_lxb_css_memory() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_css_memory> = ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_css_memory>(),
        32usize,
        concat!("Size of: ", stringify!(lxb_css_memory))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_css_memory>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_css_memory))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).objs) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_css_memory),
            "::",
            stringify!(objs)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).mraw) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_css_memory),
            "::",
            stringify!(mraw)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).tree) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_css_memory),
            "::",
            stringify!(tree)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).ref_count) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_css_memory),
            "::",
            stringify!(ref_count)
        )
    );
}
impl Default for lxb_css_memory {
    fn default() -> Self {
        let mut s = ::core::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::core::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type lxb_css_memory_t = lxb_css_memory;
pub type lxb_css_type_t = u32;
pub type lxb_css_parser_t = lxb_css_parser;
pub type lxb_css_parser_state_t = lxb_css_parser_state;
pub type lxb_css_parser_error_t = lxb_css_parser_error;
pub type lxb_css_syntax_tokenizer_t = lxb_css_syntax_tokenizer;
pub type lxb_css_syntax_token_t = lxb_css_syntax_token;
pub type lxb_css_parser_state_f = ::core::option::Option<
    unsafe extern "C" fn(
        parser: *mut lxb_css_parser_t,
        token: *const lxb_css_syntax_token_t,
        ctx: *mut cty::c_void,
    ) -> bool,
>;
pub type lxb_css_style_create_f =
    ::core::option::Option<unsafe extern "C" fn(memory: *mut lxb_css_memory_t) -> *mut cty::c_void>;
pub type lxb_css_style_serialize_f = ::core::option::Option<
    unsafe extern "C" fn(
        style: *const cty::c_void,
        cb: lexbor_serialize_cb_f,
        ctx: *mut cty::c_void,
    ) -> lxb_status_t,
>;
pub type lxb_css_style_destroy_f = ::core::option::Option<
    unsafe extern "C" fn(
        memory: *mut lxb_css_memory_t,
        style: *mut cty::c_void,
        self_destroy: bool,
    ) -> *mut cty::c_void,
>;
pub type lxb_css_stylesheet_t = lxb_css_stylesheet;
pub type lxb_css_rule_list_t = lxb_css_rule_list;
pub type lxb_css_rule_style_t = lxb_css_rule_style;
pub type lxb_css_rule_bad_style_t = lxb_css_rule_bad_style;
pub type lxb_css_rule_declaration_list_t = lxb_css_rule_declaration_list;
pub type lxb_css_rule_declaration_t = lxb_css_rule_declaration;
pub type lxb_css_rule_at_t = lxb_css_rule_at;
#[repr(C)]
#[derive(Debug, Copy, Clone, PartialEq)]
pub struct lxb_css_entry_data_t {
    pub name: *mut lxb_char_t,
    pub length: usize,
    pub unique: usize,
    pub state: lxb_css_parser_state_f,
    pub create: lxb_css_style_create_f,
    pub destroy: lxb_css_style_destroy_f,
    pub serialize: lxb_css_style_serialize_f,
    pub initial: *mut cty::c_void,
}
#[test]
fn bindgen_test_layout_lxb_css_entry_data_t() {
    const UNINIT: ::core::mem::MaybeUninit<lxb_css_entry_data_t> =
        ::core::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::core::mem::size_of::<lxb_css_entry_data_t>(),
        64usize,
        concat!("Size of: ", stringify!(lxb_css_entry_data_t))
    );
    assert_eq!(
        ::core::mem::align_of::<lxb_css_entry_data_t>(),
        8usize,
        concat!("Alignment of ", stringify!(lxb_css_entry_data_t))
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_css_entry_data_t),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::core::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(lxb_css_entry_data_t),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
